zlgopen/ametal/soc/hdsc/hc32/hc32_pin.h
/*******************************************************************************
*                                 AMetal
*                       ----------------------------
*                       innovating embedded platform
*
* Copyright (c) 2001-2018 Guangzhou ZHIYUAN Electronics Co., Ltd.
* All rights reserved.
*
* Contact information:
* web site:    http://www.zlg.cn/
*******************************************************************************/

/**
 * \file
 * \brief ZLG PIO 引脚配置参数定义
 *
 * \note: 配置引脚功能的时候一定要同时配置引脚的模式，如上下拉模式、推挽模式等
 *
 * \internal
 * \par Modification History
 * - 1.00 19-09-06  zp, first implementation
 * \endinternal
 */

#ifndef __HC32_PIN_H
#define __HC32_PIN_H

#ifdef __cplusplus
extern "C" {
#endif

#include "am_hc32_gpio_util.h"

#ifdef PIN_OUTSET
    #include "hc32_pin_outset.h"
#endif
 /**
 * \addtogroup hc32_if_pin
 * \copydoc hc32_pin.h
 * @{
 */

/**
 * \name HC32 PIO 引脚编号
 * \anchor grp_gpio_pin_number
 * @{
 */

#define PIOA            0         /**< \brief 端口A引脚起始号 */
#define PIOA_0          0         /**< \brief PIOA_0 引脚号 */
#define PIOA_1          1         /**< \brief PIOA_1 引脚号 */
#define PIOA_2          2         /**< \brief PIOA_2 引脚号 */
#define PIOA_3          3         /**< \brief PIOA_3 引脚号 */
#define PIOA_4          4         /**< \brief PIOA_4 引脚号 */
#define PIOA_5          5         /**< \brief PIOA_5 引脚号 */
#define PIOA_6          6         /**< \brief PIOA_6 引脚号 */
#define PIOA_7          7         /**< \brief PIOA_7 引脚号 */
#define PIOA_8          8         /**< \brief PIOA_8 引脚号 */
#define PIOA_9          9         /**< \brief PIOA_9 引脚号 */
#define PIOA_10         10        /**< \brief PIOA_10 引脚号 */
#define PIOA_11         11        /**< \brief PIOA_11 引脚号 */
#define PIOA_12         12        /**< \brief PIOA_13 引脚号 */
#define PIOA_13         13        /**< \brief PIOA_13 引脚号 */
#define PIOA_14         14        /**< \brief PIOA_14 引脚号 */
#define PIOA_15         15        /**< \brief PIOA_15 引脚号 */

#define PIOB            16        /**< \brief 端口B引脚起始号 */
#define PIOB_0          16        /**< \brief PIOB_8 引脚号 */
#define PIOB_1          17        /**< \brief PIOB_1 引脚号 */
#define PIOB_2          18        /**< \brief PIOB_2 引脚号 */
#define PIOB_3          19        /**< \brief PIOB_3 引脚号 */
#define PIOB_4          20        /**< \brief PIOB_4 引脚号 */
#define PIOB_5          21        /**< \brief PIOB_5 引脚号 */
#define PIOB_6          22        /**< \brief PIOB_3 引脚号 */
#define PIOB_7          23        /**< \brief PIOB_4 引脚号 */
#define PIOB_8          24        /**< \brief PIOB_5 引脚号 */
#define PIOB_9          25        /**< \brief PIOB_5 引脚号 */
#define PIOB_10         26        /**< \brief PIOB_10引脚号 */
#define PIOB_11         27        /**< \brief PIOB_11引脚号 */
#define PIOB_12         28        /**< \brief PIOB_12引脚号 */
#define PIOB_13         29        /**< \brief PIOB_13引脚号 */
#define PIOB_14         30        /**< \brief PIOB_14引脚号 */
#define PIOB_15         31        /**< \brief PIOB_15引脚号 */

#define PIOC            32        /**< \brief 端口C引脚起始号 */
#define PIOC_0          32        /**< \brief PIOC_13引脚号 */
#define PIOC_1          33        /**< \brief PIOC_13引脚号 */
#define PIOC_2          34        /**< \brief PIOC_13引脚号 */
#define PIOC_3          35        /**< \brief PIOC_13引脚号 */
#define PIOC_4          36        /**< \brief PIOC_13引脚号 */
#define PIOC_5          37        /**< \brief PIOC_13引脚号 */
#define PIOC_6          38        /**< \brief PIOC_13引脚号 */
#define PIOC_7          39        /**< \brief PIOC_13引脚号 */
#define PIOC_8          40        /**< \brief PIOC_13引脚号 */
#define PIOC_9          41        /**< \brief PIOC_13引脚号 */
#define PIOC_10         42        /**< \brief PIOC_13引脚号 */
#define PIOC_11         43        /**< \brief PIOC_13引脚号 */
#define PIOC_12         44        /**< \brief PIOC_13引脚号 */
#define PIOC_13         45        /**< \brief PIOC_13引脚号 */
#define PIOC_14         46        /**< \brief PIOC_14引脚号 */
#define PIOC_15         47        /**< \brief PIOC_15引脚号 */

#define PIOD            48        /**< \brief 端口D引脚起始号 */
#define PIOD_0          48        /**< \brief PIOD_0  引脚号 */
#define PIOD_1          59        /**< \brief PIOD_1  引脚号 */
#define PIOD_2          50        /**< \brief PIOD_2  引脚号 */
#define PIOD_3          51        /**< \brief PIOD_3  引脚号 */
#define PIOD_4          52        /**< \brief PIOD_4  引脚号 */
#define PIOD_5          53        /**< \brief PIOD_5  引脚号 */
#define PIOD_6          54        /**< \brief PIOD_6  引脚号 */
#define PIOD_7          55        /**< \brief PIOD_7  引脚号 */
#define PIOD_8          56        /**< \brief PIOD_8  引脚号 */
#define PIOD_9          57        /**< \brief PIOD_9  引脚号 */
#define PIOD_10         58        /**< \brief PIOD_10 引脚号 */
#define PIOD_11         59        /**< \brief PIOD_11 引脚号 */
#define PIOD_12         60        /**< \brief PIOD_12 引脚号 */
#define PIOD_13         61        /**< \brief PIOD_13 引脚号 */
#define PIOD_14         62        /**< \brief PIOD_14 引脚号 */
#define PIOD_15         63        /**< \brief PIOD_15 引脚号 */

#define PIOE            64        /**< \brief 端口E引脚起始号 */
#define PIOE_0          64        /**< \brief PIOE_0  引脚号 */
#define PIOE_1          65        /**< \brief PIOE_1  引脚号 */
#define PIOE_2          66        /**< \brief PIOE_2  引脚号 */
#define PIOE_3          67        /**< \brief PIOE_3  引脚号 */
#define PIOE_4          68        /**< \brief PIOE_4  引脚号 */
#define PIOE_5          69        /**< \brief PIOE_5  引脚号 */
#define PIOE_6          70        /**< \brief PIOE_6  引脚号 */
#define PIOE_7          71        /**< \brief PIOE_7  引脚号 */
#define PIOE_8          70        /**< \brief PIOE_8  引脚号 */
#define PIOE_9          73        /**< \brief PIOE_9  引脚号 */
#define PIOE_10         74        /**< \brief PIOE_10 引脚号 */
#define PIOE_11         75        /**< \brief PIOE_11 引脚号 */
#define PIOE_12         76        /**< \brief PIOE_12 引脚号 */
#define PIOE_13         77        /**< \brief PIOE_13 引脚号 */
#define PIOE_14         78        /**< \brief PIOE_14 引脚号 */
#define PIOE_15         79        /**< \brief PIOE_15 引脚号 */

#define PIOF            80       /**< \brief 端口F引脚起始号 */
#define PIOF_0          80       /**< \brief PIOF_0   引脚号 */
#define PIOF_1          81       /**< \brief PIOF_1   引脚号 */
#define PIOF_2          82       /**< \brief PIOF_2   引脚号 */
#define PIOF_3          83       /**< \brief PIOF_3   引脚号 */
#define PIOF_4          84       /**< \brief PIOF_4   引脚号 */
#define PIOF_5          85       /**< \brief PIOF_5   引脚号 */
#define PIOF_6          86       /**< \brief PIOF_6   引脚号 */
#define PIOF_7          87       /**< \brief PIOF_7   引脚号 */

/* 无PIOF_8，但是在寄存器中仍然占用了寄存器位置，特别注意不要更改引脚编号 */

#define PIOF_9          89       /**< \brief PIOF_9   引脚号 */
#define PIOF_10         90       /**< \brief PIOF_10  引脚号 */
#define PIOF_11         91       /**< \brief PIOF_11  引脚号 */

/**
 * \brief 引脚数目为96
 */
#define PIN_NUM         92

/**
 * \brief 支持同时发生最大引脚中断数是92
 */
#define PIN_INT_MAX     92

/** @} */

/**
 * \name HC32 引脚定义,除调试引脚SWCK、SWIO之外，所有引脚复位时都默认为GPIO功能(上拉输入)
 * @{
 */

/******************************************************************************/


/**
 * \name PIO引脚复用时功能模式(通用)
 * @{
 */
#define PIO_INPUT_PU       AM_HC32_GPIO_MODE_CODE(0x0)   /**< \brief 上拉输入模式 (默认) */
#define PIO_INPUT_PD       AM_HC32_GPIO_MODE_CODE(0x1)   /**< \brief 下拉输入模式 */
#define PIO_AIN            AM_HC32_GPIO_MODE_CODE(0x2)   /**< \brief 模拟输入模式 */
#define PIO_INPUT_FLOAT    AM_HC32_GPIO_MODE_CODE(0x3)   /**< \brief 浮空输入模式 */
#define PIO_OUT_PP         AM_HC32_GPIO_MODE_CODE(0x4)   /**< \brief 推挽输出模式 */
#define PIO_OUT_OD         AM_HC32_GPIO_MODE_CODE(0x5)   /**< \brief 开漏输出模式 */
#define PIO_AOUT           AM_HC32_GPIO_MODE_CODE(0x6)   /**< \brief 模拟输出模式 */
/** @} */

/**
 * \name PIOA_0引脚复用功能
 * @{
 */
#define PIOA_0_GPIO           AM_HC32_GPIO_REMAP_CODE(0x01, 0)
#define PIOA_0_UART1_CTS      AM_HC32_GPIO_REMAP_CODE(0x01, 1)
#define PIOA_0_LPUART1_TXD    AM_HC32_GPIO_REMAP_CODE(0x01, 2)
#define PIOA_0_TIM0_ETR       AM_HC32_GPIO_REMAP_CODE(0x01, 3)
#define PIOA_0_VC0_OUT        AM_HC32_GPIO_REMAP_CODE(0x01, 4)
#define PIOA_0_TIM1_CHA       AM_HC32_GPIO_REMAP_CODE(0x01, 5)
#define PIOA_0_TIM3_ETR       AM_HC32_GPIO_REMAP_CODE(0x01, 6)
#define PIOA_0_TIM0_CHA       AM_HC32_GPIO_REMAP_CODE(0x01, 7)

/** @} */

/**
 * \name PIOA_0引脚复用时功能模式
 * @{
 */
#define PIOA_0_INPUT_PU       AM_HC32_GPIO_MODE_CODE(0x0)   /**< \brief 上拉输入模式 (默认) */
#define PIOA_0_INPUT_PD       AM_HC32_GPIO_MODE_CODE(0x1)   /**< \brief 下拉输入模式 */
#define PIOA_0_AIN            AM_HC32_GPIO_MODE_CODE(0x2)   /**< \brief 模拟输入模式 */
#define PIOA_0_INPUT_FLOAT    AM_HC32_GPIO_MODE_CODE(0x3)   /**< \brief 浮空输入模式 */
#define PIOA_0_OUT_PP         AM_HC32_GPIO_MODE_CODE(0x4)   /**< \brief 推挽输出模式 */
#define PIOA_0_OUT_OD         AM_HC32_GPIO_MODE_CODE(0x5)   /**< \brief 开漏输出模式 */
#define PIOA_0_AOUT           AM_HC32_GPIO_MODE_CODE(0x6)   /**< \brief 模拟输出模式 */
/** @} */

/**
 * \name PIOA_1引脚复用功能
 * @{
 */
#define PIOA_1_GPIO           AM_HC32_GPIO_REMAP_CODE(0x01, 0)
#define PIOA_1_UART1_RTS      AM_HC32_GPIO_REMAP_CODE(0x01, 1)
#define PIOA_1_LPUART1_RXD    AM_HC32_GPIO_REMAP_CODE(0x01, 2)
#define PIOA_1_TIM0_CHB       AM_HC32_GPIO_REMAP_CODE(0x01, 3)
#define PIOA_1_TIM1_ETR       AM_HC32_GPIO_REMAP_CODE(0x01, 4)
#define PIOA_1_TIM1_CHB       AM_HC32_GPIO_REMAP_CODE(0x01, 5)
#define PIOA_1_HCLK_OUT       AM_HC32_GPIO_REMAP_CODE(0x01, 6)
#define PIOA_1_SPI1_MOSI      AM_HC32_GPIO_REMAP_CODE(0x01, 7)

/** @} */

/**
 * \name PIOA_1引脚复用时功能模式
 * @{
 */
#define PIOA_1_INPUT_PU       AM_HC32_GPIO_MODE_CODE(0x0)   /**< \brief 上拉输入模式 (默认) */
#define PIOA_1_INPUT_PD       AM_HC32_GPIO_MODE_CODE(0x1)   /**< \brief 下拉输入模式 */
#define PIOA_1_AIN            AM_HC32_GPIO_MODE_CODE(0x2)   /**< \brief 模拟输入模式 */
#define PIOA_1_INPUT_FLOAT    AM_HC32_GPIO_MODE_CODE(0x3)   /**< \brief 浮空输入模式 */
#define PIOA_1_OUT_PP         AM_HC32_GPIO_MODE_CODE(0x4)   /**< \brief 推挽输出模式 */
#define PIOA_1_OUT_OD         AM_HC32_GPIO_MODE_CODE(0x5)   /**< \brief 开漏输出模式 */
#define PIOA_1_AOUT           AM_HC32_GPIO_MODE_CODE(0x6)   /**< \brief 模拟输出模式 */
/** @} */

/**
 * \name PIOA_2引脚复用功能
 * @{
 */
#define PIOA_2_GPIO           AM_HC32_GPIO_REMAP_CODE(0x01, 0)
#define PIOA_2_UART1_TXD      AM_HC32_GPIO_REMAP_CODE(0x01, 1)
#define PIOA_2_TIM0_CHA       AM_HC32_GPIO_REMAP_CODE(0x01, 2)
#define PIOA_2_VC1_OUT        AM_HC32_GPIO_REMAP_CODE(0x01, 3)
#define PIOA_2_TIM1_CHA       AM_HC32_GPIO_REMAP_CODE(0x01, 4)
#define PIOA_2_TIM2_CHA       AM_HC32_GPIO_REMAP_CODE(0x01, 5)
#define PIOA_2_PCLK_OUT       AM_HC32_GPIO_REMAP_CODE(0x01, 6)
#define PIOA_2_SPI1_MISO      AM_HC32_GPIO_REMAP_CODE(0x01, 7)

/** @} */

/**
 * \name PIOA_2引脚复用时功能模式
 * @{
 */

#define PIOA_2_INPUT_PU       AM_HC32_GPIO_MODE_CODE(0x0)   /**< \brief 上拉输入模式 (默认) */
#define PIOA_2_INPUT_PD       AM_HC32_GPIO_MODE_CODE(0x1)   /**< \brief 下拉输入模式 */
#define PIOA_2_AIN            AM_HC32_GPIO_MODE_CODE(0x2)   /**< \brief 模拟输入模式 */
#define PIOA_2_INPUT_FLOAT    AM_HC32_GPIO_MODE_CODE(0x3)   /**< \brief 浮空输入模式 */
#define PIOA_2_OUT_PP         AM_HC32_GPIO_MODE_CODE(0x4)   /**< \brief 推挽输出模式 */
#define PIOA_2_OUT_OD         AM_HC32_GPIO_MODE_CODE(0x5)   /**< \brief 开漏输出模式 */
#define PIOA_2_AOUT           AM_HC32_GPIO_MODE_CODE(0x6)   /**< \brief 模拟输出模式 */
/** @} */

/**
 * \name PIOA_3引脚复用功能
 * @{
 */
#define PIOA_3_GPIO           AM_HC32_GPIO_REMAP_CODE(0x01, 0)
#define PIOA_3_UART1_RXD      AM_HC32_GPIO_REMAP_CODE(0x01, 1)
#define PIOA_3_TIM0_GATE      AM_HC32_GPIO_REMAP_CODE(0x01, 2)
#define PIOA_3_TIM1_CHB       AM_HC32_GPIO_REMAP_CODE(0x01, 3)
#define PIOA_3_TIM2_CHB       AM_HC32_GPIO_REMAP_CODE(0x01, 4)
#define PIOA_3_SPI1_CS        AM_HC32_GPIO_REMAP_CODE(0x01, 5)
#define PIOA_3_TIM3_CH1A      AM_HC32_GPIO_REMAP_CODE(0x01, 6)
#define PIOA_3_TIM5_CHA       AM_HC32_GPIO_REMAP_CODE(0x01, 7)

/** @} */

/**
 * \name PIOA_3引脚复用时功能模式
 * @{
 */
#define PIOA_3_INPUT_PU       AM_HC32_GPIO_MODE_CODE(0x0)   /**< \brief 上拉输入模式 (默认) */
#define PIOA_3_INPUT_PD       AM_HC32_GPIO_MODE_CODE(0x1)   /**< \brief 下拉输入模式 */
#define PIOA_3_AIN            AM_HC32_GPIO_MODE_CODE(0x2)   /**< \brief 模拟输入模式 */
#define PIOA_3_INPUT_FLOAT    AM_HC32_GPIO_MODE_CODE(0x3)   /**< \brief 浮空输入模式 */
#define PIOA_3_OUT_PP         AM_HC32_GPIO_MODE_CODE(0x4)   /**< \brief 推挽输出模式 */
#define PIOA_3_OUT_OD         AM_HC32_GPIO_MODE_CODE(0x5)   /**< \brief 开漏输出模式 */
#define PIOA_3_AOUT           AM_HC32_GPIO_MODE_CODE(0x6)   /**< \brief 模拟输出模式 */
/** @} */

/**
 * \name PIOA_4引脚复用功能
 * @{
 */
#define PIOA_4_GPIO           AM_HC32_GPIO_REMAP_CODE(0x01, 0)
#define PIOA_4_SPI0_CS        AM_HC32_GPIO_REMAP_CODE(0x01, 1)
#define PIOA_4_UART1_TXD      AM_HC32_GPIO_REMAP_CODE(0x01, 2)
#define PIOA_4_PCA_CH4        AM_HC32_GPIO_REMAP_CODE(0x01, 3)
#define PIOA_4_TIM2_ETR       AM_HC32_GPIO_REMAP_CODE(0x01, 4)
#define PIOA_4_TIM5_CHA       AM_HC32_GPIO_REMAP_CODE(0x01, 5)
#define PIOA_4_LVD_OUT        AM_HC32_GPIO_REMAP_CODE(0x01, 6)
#define PIOA_4_TIM3_CH2B      AM_HC32_GPIO_REMAP_CODE(0x01, 7)

/** @} */

/**
 * \name PIOA_4引脚复用时功能模式
 * @{
 */
#define PIOA_4_INPUT_PU       AM_HC32_GPIO_MODE_CODE(0x0)   /**< \brief 上拉输入模式 (默认) */
#define PIOA_4_INPUT_PD       AM_HC32_GPIO_MODE_CODE(0x1)   /**< \brief 下拉输入模式 */
#define PIOA_4_AIN            AM_HC32_GPIO_MODE_CODE(0x2)   /**< \brief 模拟输入模式 */
#define PIOA_4_INPUT_FLOAT    AM_HC32_GPIO_MODE_CODE(0x3)   /**< \brief 浮空输入模式 */
#define PIOA_4_OUT_PP         AM_HC32_GPIO_MODE_CODE(0x4)   /**< \brief 推挽输出模式 */
#define PIOA_4_OUT_OD         AM_HC32_GPIO_MODE_CODE(0x5)   /**< \brief 开漏输出模式 */
#define PIOA_4_AOUT           AM_HC32_GPIO_MODE_CODE(0x6)   /**< \brief 模拟输出模式 */
/** @} */

/**
 * \name PIOA_5引脚复用功能
 * @{
 */
#define PIOA_5_GPIO           AM_HC32_GPIO_REMAP_CODE(0x01, 0)
#define PIOA_5_SPI0_SCK       AM_HC32_GPIO_REMAP_CODE(0x01, 1)
#define PIOA_5_TIM0_ETR       AM_HC32_GPIO_REMAP_CODE(0x01, 2)
#define PIOA_5_PCA_ECI        AM_HC32_GPIO_REMAP_CODE(0x01, 3)
#define PIOA_5_TIM0_CHA       AM_HC32_GPIO_REMAP_CODE(0x01, 4)
#define PIOA_5_TIM5_CHB       AM_HC32_GPIO_REMAP_CODE(0x01, 5)
#define PIOA_5_XTL_OUT        AM_HC32_GPIO_REMAP_CODE(0x01, 6)
#define PIOA_5_XTH_OUT        AM_HC32_GPIO_REMAP_CODE(0x01, 7)

/** @} */

/**
 * \name PIOA_5引脚复用时功能模式
 * @{
 */
#define PIOA_5_INPUT_PU       AM_HC32_GPIO_MODE_CODE(0x0)   /**< \brief 上拉输入模式 (默认) */
#define PIOA_5_INPUT_PD       AM_HC32_GPIO_MODE_CODE(0x1)   /**< \brief 下拉输入模式 */
#define PIOA_5_AIN            AM_HC32_GPIO_MODE_CODE(0x2)   /**< \brief 模拟输入模式 */
#define PIOA_5_INPUT_FLOAT    AM_HC32_GPIO_MODE_CODE(0x3)   /**< \brief 浮空输入模式 */
#define PIOA_5_OUT_PP         AM_HC32_GPIO_MODE_CODE(0x4)   /**< \brief 推挽输出模式 */
#define PIOA_5_OUT_OD         AM_HC32_GPIO_MODE_CODE(0x5)   /**< \brief 开漏输出模式 */
#define PIOA_5_AOUT           AM_HC32_GPIO_MODE_CODE(0x6)   /**< \brief 模拟输出模式 */
/** @} */

/**
 * \name PIOA_6引脚复用功能
 * @{
 */
#define PIOA_6_GPIO           AM_HC32_GPIO_REMAP_CODE(0x01, 0)
#define PIOA_6_SPI0_MISO      AM_HC32_GPIO_REMAP_CODE(0x01, 1)
#define PIOA_6_PCA_CH0        AM_HC32_GPIO_REMAP_CODE(0x01, 2)
#define PIOA_6_TIM3_BK        AM_HC32_GPIO_REMAP_CODE(0x01, 3)
#define PIOA_6_TIM1_CHA       AM_HC32_GPIO_REMAP_CODE(0x01, 4)
#define PIOA_6_VC0_OUT        AM_HC32_GPIO_REMAP_CODE(0x01, 5)
#define PIOA_6_TIM3_GATE      AM_HC32_GPIO_REMAP_CODE(0x01, 6)
#define PIOA_6_LPUART0_CTS    AM_HC32_GPIO_REMAP_CODE(0x01, 7)

/** @} */

/**
 * \name PIOA_6引脚复用时功能模式
 * @{
 */
#define PIOA_6_INPUT_PU       AM_HC32_GPIO_MODE_CODE(0x0)   /**< \brief 上拉输入模式 (默认) */
#define PIOA_6_INPUT_PD       AM_HC32_GPIO_MODE_CODE(0x1)   /**< \brief 下拉输入模式 */
#define PIOA_6_AIN            AM_HC32_GPIO_MODE_CODE(0x2)   /**< \brief 模拟输入模式 */
#define PIOA_6_INPUT_FLOAT    AM_HC32_GPIO_MODE_CODE(0x3)   /**< \brief 浮空输入模式 */
#define PIOA_6_OUT_PP         AM_HC32_GPIO_MODE_CODE(0x4)   /**< \brief 推挽输出模式 */
#define PIOA_6_OUT_OD         AM_HC32_GPIO_MODE_CODE(0x5)   /**< \brief 开漏输出模式 */
#define PIOA_6_AOUT           AM_HC32_GPIO_MODE_CODE(0x6)   /**< \brief 模拟输出模式 */
/** @} */

/**
 * \name PIOA_7引脚复用功能
 * @{
 */
#define PIOA_7_GPIO           AM_HC32_GPIO_REMAP_CODE(0x01, 0)
#define PIOA_7_SPI0_MOSI      AM_HC32_GPIO_REMAP_CODE(0x01, 1)
#define PIOA_7_PCA_CH1        AM_HC32_GPIO_REMAP_CODE(0x01, 2)
#define PIOA_7_HCLK_OUT       AM_HC32_GPIO_REMAP_CODE(0x01, 3)
#define PIOA_7_TIM3_CH0B      AM_HC32_GPIO_REMAP_CODE(0x01, 4)
#define PIOA_7_TIM2_CHA       AM_HC32_GPIO_REMAP_CODE(0x01, 5)
#define PIOA_7_VC1_OUT        AM_HC32_GPIO_REMAP_CODE(0x01, 6)
#define PIOA_7_TIM4_CHB       AM_HC32_GPIO_REMAP_CODE(0x01, 7)

/** @} */

/**
 * \name PIOA_7引脚复用时功能模式
 * @{
 */
#define PIOA_7_INPUT_PU       AM_HC32_GPIO_MODE_CODE(0x0)   /**< \brief 上拉输入模式 (默认) */
#define PIOA_7_INPUT_PD       AM_HC32_GPIO_MODE_CODE(0x1)   /**< \brief 下拉输入模式 */
#define PIOA_7_AIN            AM_HC32_GPIO_MODE_CODE(0x2)   /**< \brief 模拟输入模式 */
#define PIOA_7_INPUT_FLOAT    AM_HC32_GPIO_MODE_CODE(0x3)   /**< \brief 浮空输入模式 */
#define PIOA_7_OUT_PP         AM_HC32_GPIO_MODE_CODE(0x4)   /**< \brief 推挽输出模式 */
#define PIOA_7_OUT_OD         AM_HC32_GPIO_MODE_CODE(0x5)   /**< \brief 开漏输出模式 */
#define PIOA_7_AOUT           AM_HC32_GPIO_MODE_CODE(0x6)   /**< \brief 模拟输出模式 */
/** @} */

/**
 * \name PIOA_8引脚复用功能
 * @{
 */
#define PIOA_8_GPIO           AM_HC32_GPIO_REMAP_CODE(0x01, 0)
#define PIOA_8_ART0_TXD       AM_HC32_GPIO_REMAP_CODE(0x01, 1)
#define PIOA_8_TIM3_CH0A      AM_HC32_GPIO_REMAP_CODE(0x01, 2)
#define PIOA_8_TIM1_GATE      AM_HC32_GPIO_REMAP_CODE(0x01, 5)
#define PIOA_8_TIM4_CHA       AM_HC32_GPIO_REMAP_CODE(0x01, 6)
#define PIOA_8_TIM3_BK        AM_HC32_GPIO_REMAP_CODE(0x01, 7)

/** @} */

/**
 * \name PIOA_8引脚复用时功能模式
 * @{
 */
#define PIOA_8_INPUT_PU       AM_HC32_GPIO_MODE_CODE(0x0)   /**< \brief 上拉输入模式 (默认) */
#define PIOA_8_INPUT_PD       AM_HC32_GPIO_MODE_CODE(0x1)   /**< \brief 下拉输入模式 */
#define PIOA_8_AIN            AM_HC32_GPIO_MODE_CODE(0x2)   /**< \brief 模拟输入模式 */
#define PIOA_8_INPUT_FLOAT    AM_HC32_GPIO_MODE_CODE(0x3)   /**< \brief 浮空输入模式 */
#define PIOA_8_OUT_PP         AM_HC32_GPIO_MODE_CODE(0x4)   /**< \brief 推挽输出模式 */
#define PIOA_8_OUT_OD         AM_HC32_GPIO_MODE_CODE(0x5)   /**< \brief 开漏输出模式 */
#define PIOA_8_AOUT           AM_HC32_GPIO_MODE_CODE(0x6)   /**< \brief 模拟输出模式 */
/** @} */

/**
 * \name PIOA_9引脚复用功能
 * @{
 */
#define PIOA_9_GPIO           AM_HC32_GPIO_REMAP_CODE(0x01, 0)
#define PIOA_9_UART0_TXD      AM_HC32_GPIO_REMAP_CODE(0x01, 1)
#define PIOA_9_TIM3_CH1A      AM_HC32_GPIO_REMAP_CODE(0x01, 2)
#define PIOA_9_TIM0_BK        AM_HC32_GPIO_REMAP_CODE(0x01, 3)
#define PIOA_9_I2C0_SCL       AM_HC32_GPIO_REMAP_CODE(0x01, 4)
#define PIOA_9_HCLK_OUT       AM_HC32_GPIO_REMAP_CODE(0x01, 6)
#define PIOA_9_TIM5_CHA       AM_HC32_GPIO_REMAP_CODE(0x01, 7)

/** @} */

/**
 * \name PIOA_9引脚复用时功能模式
 * @{
 */
#define PIOA_9_INPUT_PU       AM_HC32_GPIO_MODE_CODE(0x0)   /**< \brief 上拉输入模式 (默认) */
#define PIOA_9_INPUT_PD       AM_HC32_GPIO_MODE_CODE(0x1)   /**< \brief 下拉输入模式 */
#define PIOA_9_AIN            AM_HC32_GPIO_MODE_CODE(0x2)   /**< \brief 模拟输入模式 */
#define PIOA_9_INPUT_FLOAT    AM_HC32_GPIO_MODE_CODE(0x3)   /**< \brief 浮空输入模式 */
#define PIOA_9_OUT_PP         AM_HC32_GPIO_MODE_CODE(0x4)   /**< \brief 推挽输出模式 */
#define PIOA_9_OUT_OD         AM_HC32_GPIO_MODE_CODE(0x5)   /**< \brief 开漏输出模式 */
#define PIOA_9_AOUT           AM_HC32_GPIO_MODE_CODE(0x6)   /**< \brief 模拟输出模式 */
/** @} */

/**
 * \name PIOA_10引脚复用功能
 * @{
 */
#define PIOA_10_GPIO           AM_HC32_GPIO_REMAP_CODE(0x01, 0)
#define PIOA_10_UART0_RXD      AM_HC32_GPIO_REMAP_CODE(0x01, 1)
#define PIOA_10_TIM3_CH2A      AM_HC32_GPIO_REMAP_CODE(0x01, 2)
#define PIOA_10_TIM2_BK        AM_HC32_GPIO_REMAP_CODE(0x01, 3)
#define PIOA_10_I2C0_SDA       AM_HC32_GPIO_REMAP_CODE(0x01, 4)
#define PIOA_10_TIM2_GATE      AM_HC32_GPIO_REMAP_CODE(0x01, 5)
#define PIOA_10_PCLK_OUT       AM_HC32_GPIO_REMAP_CODE(0x01, 6)
#define PIOA_10_TIM6_CHA       AM_HC32_GPIO_REMAP_CODE(0x01, 7)

/** @} */

/**
 * \name PIOA_10引脚复用时功能模式
 * @{
 */
#define PIOA_10_INPUT_PU       AM_HC32_GPIO_MODE_CODE(0x0)   /**< \brief 上拉输入模式 (默认) */
#define PIOA_10_INPUT_PD       AM_HC32_GPIO_MODE_CODE(0x1)   /**< \brief 下拉输入模式 */
#define PIOA_10_AIN            AM_HC32_GPIO_MODE_CODE(0x2)   /**< \brief 模拟输入模式 */
#define PIOA_10_INPUT_FLOAT    AM_HC32_GPIO_MODE_CODE(0x3)   /**< \brief 浮空输入模式 */
#define PIOA_10_OUT_PP         AM_HC32_GPIO_MODE_CODE(0x4)   /**< \brief 推挽输出模式 */
#define PIOA_10_OUT_OD         AM_HC32_GPIO_MODE_CODE(0x5)   /**< \brief 开漏输出模式 */
#define PIOA_10_AOUT           AM_HC32_GPIO_MODE_CODE(0x6)   /**< \brief 模拟输出模式 */
/** @} */

/**
 * \name PIOA_11引脚复用功能
 * @{
 */
#define PIOA_11_GPIO           AM_HC32_GPIO_REMAP_CODE(0x01, 0)
#define PIOA_11_UART0_CTS      AM_HC32_GPIO_REMAP_CODE(0x01, 1)
#define PIOA_11_TIM3_GATE      AM_HC32_GPIO_REMAP_CODE(0x01, 2)
#define PIOA_11_I2C1_SCL       AM_HC32_GPIO_REMAP_CODE(0x01, 3)
#define PIOA_11_VC0_OUT        AM_HC32_GPIO_REMAP_CODE(0x01, 5)
#define PIOA_11_SPI0_MISO      AM_HC32_GPIO_REMAP_CODE(0x01, 6)
#define PIOA_11_TIM4_CHB       AM_HC32_GPIO_REMAP_CODE(0x01, 7)

/** @} */

/**
 * \name PIOA_11引脚复用时功能模式
 * @{
 */
#define PIOA_11_INPUT_PU       AM_HC32_GPIO_MODE_CODE(0x0)   /**< \brief 上拉输入模式 (默认) */
#define PIOA_11_INPUT_PD       AM_HC32_GPIO_MODE_CODE(0x1)   /**< \brief 下拉输入模式 */
#define PIOA_11_AIN            AM_HC32_GPIO_MODE_CODE(0x2)   /**< \brief 模拟输入模式 */
#define PIOA_11_INPUT_FLOAT    AM_HC32_GPIO_MODE_CODE(0x3)   /**< \brief 浮空输入模式 */
#define PIOA_11_OUT_PP         AM_HC32_GPIO_MODE_CODE(0x4)   /**< \brief 推挽输出模式 */
#define PIOA_11_OUT_OD         AM_HC32_GPIO_MODE_CODE(0x5)   /**< \brief 开漏输出模式 */
#define PIOA_11_AOUT           AM_HC32_GPIO_MODE_CODE(0x6)   /**< \brief 模拟输出模式 */
/** @} */

/**
 * \name PIOA_12引脚复用功能
 * @{
 */
#define PIOA_12_GPIO           AM_HC32_GPIO_REMAP_CODE(0x01, 0)
#define PIOA_12_UART0_RTS      AM_HC32_GPIO_REMAP_CODE(0x01, 1)
#define PIOA_12_TIM3_ETR       AM_HC32_GPIO_REMAP_CODE(0x01, 2)
#define PIOA_12_I2C1_SDA       AM_HC32_GPIO_REMAP_CODE(0x01, 3)
#define PIOA_12_VC1_OUT        AM_HC32_GPIO_REMAP_CODE(0x01, 5)
#define PIOA_12_SPI0_MOSI      AM_HC32_GPIO_REMAP_CODE(0x01, 6)
#define PIOA_12_PCNT_S0        AM_HC32_GPIO_REMAP_CODE(0x01, 7)

/** @} */

/**
 * \name PIOA_12引脚复用时功能模式
 * @{
 */
#define PIOA_12_INPUT_PU       AM_HC32_GPIO_MODE_CODE(0x0)   /**< \brief 上拉输入模式 (默认) */
#define PIOA_12_INPUT_PD       AM_HC32_GPIO_MODE_CODE(0x1)   /**< \brief 下拉输入模式 */
#define PIOA_12_AIN            AM_HC32_GPIO_MODE_CODE(0x2)   /**< \brief 模拟输入模式 */
#define PIOA_12_INPUT_FLOAT    AM_HC32_GPIO_MODE_CODE(0x3)   /**< \brief 浮空输入模式 */
#define PIOA_12_OUT_PP         AM_HC32_GPIO_MODE_CODE(0x4)   /**< \brief 推挽输出模式 */
#define PIOA_12_OUT_OD         AM_HC32_GPIO_MODE_CODE(0x5)   /**< \brief 开漏输出模式 */
#define PIOA_12_AOUT           AM_HC32_GPIO_MODE_CODE(0x6)   /**< \brief 模拟输出模式 */
/** @} */

/**
 * \name PIOA_13引脚复用功能
 * @{
 */
#define PIOA_13_GPIO           AM_HC32_GPIO_REMAP_CODE(0x01, 0)
#define PIOA_13_IR_OUT         AM_HC32_GPIO_REMAP_CODE(0x01, 1)
#define PIOA_13_UART0_RXD      AM_HC32_GPIO_REMAP_CODE(0x01, 2)
#define PIOA_13_LVD_OUT        AM_HC32_GPIO_REMAP_CODE(0x01, 3)
#define PIOA_13_TIM3_ETR       AM_HC32_GPIO_REMAP_CODE(0x01, 4)
#define PIOA_13_RTC_1HZ        AM_HC32_GPIO_REMAP_CODE(0x01, 5)
#define PIOA_13_PCNT_S1        AM_HC32_GPIO_REMAP_CODE(0x01, 6)
#define PIOA_13_VC2_OUT        AM_HC32_GPIO_REMAP_CODE(0x01, 7)

/** @} */

