zlgopen/ametal/soc/hdsc/hc32/hc32_pin.h
/**
 * \name PIOC_2引脚复用时功能模式
 * @{
 */
#define PIOC_2_INPUT_PU       AM_HC32_GPIO_MODE_CODE(0x0)   /**< \brief 上拉输入模式 (默认) */
#define PIOC_2_INPUT_PD       AM_HC32_GPIO_MODE_CODE(0x1)   /**< \brief 下拉输入模式 */
#define PIOC_2_AIN            AM_HC32_GPIO_MODE_CODE(0x2)   /**< \brief 模拟输入模式 */
#define PIOC_2_INPUT_FLOAT    AM_HC32_GPIO_MODE_CODE(0x3)   /**< \brief 浮空输入模式 */
#define PIOC_2_OUT_PP         AM_HC32_GPIO_MODE_CODE(0x4)   /**< \brief 推挽输出模式 */
#define PIOC_2_OUT_OD         AM_HC32_GPIO_MODE_CODE(0x5)   /**< \brief 开漏输出模式 */
#define PIOC_2_AOUT           AM_HC32_GPIO_MODE_CODE(0x6)   /**< \brief 模拟输出模式 */
/** @} */

/**
 * \name PIOC_3引脚复用功能
 * @{
 */
#define PIOC_3_GPIO           AM_HC32_GPIO_REMAP_CODE(0x03, 0)
#define PIOC_3_SPI1_MOSI      AM_HC32_GPIO_REMAP_CODE(0x03, 1)
#define PIOC_3_LPTIM0_ETR     AM_HC32_GPIO_REMAP_CODE(0x03, 2)
#define PIOC_3_LPTIM0_TOGN    AM_HC32_GPIO_REMAP_CODE(0x03, 3)
#define PIOC_3_PCNT_S1FO      AM_HC32_GPIO_REMAP_CODE(0x03, 4)
#define PIOC_3_UART2_TXD      AM_HC32_GPIO_REMAP_CODE(0x03, 5)

/** @} */

/**
 * \name PIOC_3引脚复用时功能模式
 * @{
 */
#define PIOC_3_INPUT_PU       AM_HC32_GPIO_MODE_CODE(0x0)   /**< \brief 上拉输入模式 (默认) */
#define PIOC_3_INPUT_PD       AM_HC32_GPIO_MODE_CODE(0x1)   /**< \brief 下拉输入模式 */
#define PIOC_3_AIN            AM_HC32_GPIO_MODE_CODE(0x2)   /**< \brief 模拟输入模式 */
#define PIOC_3_INPUT_FLOAT    AM_HC32_GPIO_MODE_CODE(0x3)   /**< \brief 浮空输入模式 */
#define PIOC_3_OUT_PP         AM_HC32_GPIO_MODE_CODE(0x4)   /**< \brief 推挽输出模式 */
#define PIOC_3_OUT_OD         AM_HC32_GPIO_MODE_CODE(0x5)   /**< \brief 开漏输出模式 */
#define PIOC_3_AOUT           AM_HC32_GPIO_MODE_CODE(0x6)   /**< \brief 模拟输出模式 */
/** @} */

/**
 * \name PIOC_4引脚复用功能
 * @{
 */
#define PIOC_4_GPIO           AM_HC32_GPIO_REMAP_CODE(0x03, 0)
#define PIOC_4_LPUART0_TXD    AM_HC32_GPIO_REMAP_CODE(0x03, 1)
#define PIOC_4_TIM2_ETR       AM_HC32_GPIO_REMAP_CODE(0x03, 2)
#define PIOC_4_IR_OUT         AM_HC32_GPIO_REMAP_CODE(0x03, 3)
#define PIOC_4_VC2_OUT        AM_HC32_GPIO_REMAP_CODE(0x03, 4)

/** @} */

/**
 * \name PIOC_4引脚复用时功能模式
 * @{
 */
#define PIOC_4_INPUT_PU       AM_HC32_GPIO_MODE_CODE(0x0)   /**< \brief 上拉输入模式 (默认) */
#define PIOC_4_INPUT_PD       AM_HC32_GPIO_MODE_CODE(0x1)   /**< \brief 下拉输入模式 */
#define PIOC_4_AIN            AM_HC32_GPIO_MODE_CODE(0x2)   /**< \brief 模拟输入模式 */
#define PIOC_4_INPUT_FLOAT    AM_HC32_GPIO_MODE_CODE(0x3)   /**< \brief 浮空输入模式 */
#define PIOC_4_OUT_PP         AM_HC32_GPIO_MODE_CODE(0x4)   /**< \brief 推挽输出模式 */
#define PIOC_4_OUT_OD         AM_HC32_GPIO_MODE_CODE(0x5)   /**< \brief 开漏输出模式 */
#define PIOC_4_AOUT           AM_HC32_GPIO_MODE_CODE(0x6)   /**< \brief 模拟输出模式 */
/** @} */

/**
 * \name PIOC_5引脚复用功能
 * @{
 */
#define PIOC_5_GPIO           AM_HC32_GPIO_REMAP_CODE(0x03, 0)
#define PIOC_5_LPUART0_RXD    AM_HC32_GPIO_REMAP_CODE(0x03, 1)
#define PIOC_5_TIM6_CHB       AM_HC32_GPIO_REMAP_CODE(0x03, 2)
#define PIOC_5_PCA_CH4        AM_HC32_GPIO_REMAP_CODE(0x03, 3)

/** @} */

/**
 * \name PIOC_5引脚复用时功能模式
 * @{
 */
#define PIOC_5_INPUT_PU       AM_HC32_GPIO_MODE_CODE(0x0)   /**< \brief 上拉输入模式 (默认) */
#define PIOC_5_INPUT_PD       AM_HC32_GPIO_MODE_CODE(0x1)   /**< \brief 下拉输入模式 */
#define PIOC_5_AIN            AM_HC32_GPIO_MODE_CODE(0x2)   /**< \brief 模拟输入模式 */
#define PIOC_5_INPUT_FLOAT    AM_HC32_GPIO_MODE_CODE(0x3)   /**< \brief 浮空输入模式 */
#define PIOC_5_OUT_PP         AM_HC32_GPIO_MODE_CODE(0x4)   /**< \brief 推挽输出模式 */
#define PIOC_5_OUT_OD         AM_HC32_GPIO_MODE_CODE(0x5)   /**< \brief 开漏输出模式 */
#define PIOC_5_AOUT           AM_HC32_GPIO_MODE_CODE(0x6)   /**< \brief 模拟输出模式 */
/** @} */

/**
 * \name PIOC_6引脚复用功能
 * @{
 */
#define PIOC_6_GPIO           AM_HC32_GPIO_REMAP_CODE(0x03, 0)
#define PIOC_6_PCA_CH0        AM_HC32_GPIO_REMAP_CODE(0x03, 1)
#define PIOC_6_TIM4_CHA       AM_HC32_GPIO_REMAP_CODE(0x03, 2)
#define PIOC_6_TIM2_CHA       AM_HC32_GPIO_REMAP_CODE(0x03, 3)
#define PIOC_6_LPTIM1_GATE    AM_HC32_GPIO_REMAP_CODE(0x03, 4)
#define PIOC_6_UART3_RXD      AM_HC32_GPIO_REMAP_CODE(0x03, 6)

/** @} */

/**
 * \name PIOC_6引脚复用时功能模式
 * @{
 */
#define PIOC_6_INPUT_PU       AM_HC32_GPIO_MODE_CODE(0x0)   /**< \brief 上拉输入模式 (默认) */
#define PIOC_6_INPUT_PD       AM_HC32_GPIO_MODE_CODE(0x1)   /**< \brief 下拉输入模式 */
#define PIOC_6_AIN            AM_HC32_GPIO_MODE_CODE(0x2)   /**< \brief 模拟输入模式 */
#define PIOC_6_INPUT_FLOAT    AM_HC32_GPIO_MODE_CODE(0x3)   /**< \brief 浮空输入模式 */
#define PIOC_6_OUT_PP         AM_HC32_GPIO_MODE_CODE(0x4)   /**< \brief 推挽输出模式 */
#define PIOC_6_OUT_OD         AM_HC32_GPIO_MODE_CODE(0x5)   /**< \brief 开漏输出模式 */
#define PIOC_6_AOUT           AM_HC32_GPIO_MODE_CODE(0x6)   /**< \brief 模拟输出模式 */
/** @} */

/**
 * \name PIOC_7引脚复用功能
 * @{
 */
#define PIOC_7_GPIO           AM_HC32_GPIO_REMAP_CODE(0x03, 0)
#define PIOC_7_PCA_CH1        AM_HC32_GPIO_REMAP_CODE(0x03, 1)
#define PIOC_7_TIM5_CHA       AM_HC32_GPIO_REMAP_CODE(0x03, 2)
#define PIOC_7_TIM2_CHB       AM_HC32_GPIO_REMAP_CODE(0x03, 3)
#define PIOC_7_LPTIM1_ETR     AM_HC32_GPIO_REMAP_CODE(0x03, 4)
#define PIOC_7_UART3_TXD      AM_HC32_GPIO_REMAP_CODE(0x03, 6)

/** @} */

/**
 * \name PIOC_7引脚复用时功能模式
 * @{
 */
#define PIOC_7_INPUT_PU       AM_HC32_GPIO_MODE_CODE(0x0)   /**< \brief 上拉输入模式 (默认) */
#define PIOC_7_INPUT_PD       AM_HC32_GPIO_MODE_CODE(0x1)   /**< \brief 下拉输入模式 */
#define PIOC_7_AIN            AM_HC32_GPIO_MODE_CODE(0x2)   /**< \brief 模拟输入模式 */
#define PIOC_7_INPUT_FLOAT    AM_HC32_GPIO_MODE_CODE(0x3)   /**< \brief 浮空输入模式 */
#define PIOC_7_OUT_PP         AM_HC32_GPIO_MODE_CODE(0x4)   /**< \brief 推挽输出模式 */
#define PIOC_7_OUT_OD         AM_HC32_GPIO_MODE_CODE(0x5)   /**< \brief 开漏输出模式 */
#define PIOC_7_AOUT           AM_HC32_GPIO_MODE_CODE(0x6)   /**< \brief 模拟输出模式 */
/** @} */

/**
 * \name PIOC_8引脚复用功能
 * @{
 */
#define PIOC_8_GPIO           AM_HC32_GPIO_REMAP_CODE(0x03, 0)
#define PIOC_8_PCA_CH2        AM_HC32_GPIO_REMAP_CODE(0x03, 1)
#define PIOC_8_TIM6_CHA       AM_HC32_GPIO_REMAP_CODE(0x03, 2)
#define PIOC_8_TIM2_ETR       AM_HC32_GPIO_REMAP_CODE(0x03, 3)
#define PIOC_8_LPTIM1_TOG     AM_HC32_GPIO_REMAP_CODE(0x03, 4)
#define PIOC_8_UART3_CTS      AM_HC32_GPIO_REMAP_CODE(0x03, 6)

/** @} */

/**
 * \name PIOC_8引脚复用时功能模式
 * @{
 */
#define PIOC_8_INPUT_PU       AM_HC32_GPIO_MODE_CODE(0x0)   /**< \brief 上拉输入模式 (默认) */
#define PIOC_8_INPUT_PD       AM_HC32_GPIO_MODE_CODE(0x1)   /**< \brief 下拉输入模式 */
#define PIOC_8_AIN            AM_HC32_GPIO_MODE_CODE(0x2)   /**< \brief 模拟输入模式 */
#define PIOC_8_INPUT_FLOAT    AM_HC32_GPIO_MODE_CODE(0x3)   /**< \brief 浮空输入模式 */
#define PIOC_8_OUT_PP         AM_HC32_GPIO_MODE_CODE(0x4)   /**< \brief 推挽输出模式 */
#define PIOC_8_OUT_OD         AM_HC32_GPIO_MODE_CODE(0x5)   /**< \brief 开漏输出模式 */
#define PIOC_8_AOUT           AM_HC32_GPIO_MODE_CODE(0x6)   /**< \brief 模拟输出模式 */
/** @} */

/**
 * \name PIOC_9引脚复用功能
 * @{
 */
#define PIOC_9_GPIO           AM_HC32_GPIO_REMAP_CODE(0x03, 0)
#define PIOC_9_PCA_CH3        AM_HC32_GPIO_REMAP_CODE(0x03, 1)
#define PIOC_9_TIM4_CHB       AM_HC32_GPIO_REMAP_CODE(0x03, 2)
#define PIOC_9_TIM1_ETR       AM_HC32_GPIO_REMAP_CODE(0x03, 3)
#define PIOC_9_LPTIM1_TOGN    AM_HC32_GPIO_REMAP_CODE(0x03, 4)
#define PIOC_9_UART3_RTS      AM_HC32_GPIO_REMAP_CODE(0x03, 6)

/** @} */

/**
 * \name PIOC_9引脚复用时功能模式
 * @{
 */
#define PIOC_9_INPUT_PU       AM_HC32_GPIO_MODE_CODE(0x0)   /**< \brief 上拉输入模式 (默认) */
#define PIOC_9_INPUT_PD       AM_HC32_GPIO_MODE_CODE(0x1)   /**< \brief 下拉输入模式 */
#define PIOC_9_AIN            AM_HC32_GPIO_MODE_CODE(0x2)   /**< \brief 模拟输入模式 */
#define PIOC_9_INPUT_FLOAT    AM_HC32_GPIO_MODE_CODE(0x3)   /**< \brief 浮空输入模式 */
#define PIOC_9_OUT_PP         AM_HC32_GPIO_MODE_CODE(0x4)   /**< \brief 推挽输出模式 */
#define PIOC_9_OUT_OD         AM_HC32_GPIO_MODE_CODE(0x5)   /**< \brief 开漏输出模式 */
#define PIOC_9_AOUT           AM_HC32_GPIO_MODE_CODE(0x6)   /**< \brief 模拟输出模式 */
/** @} */

/**
 * \name PIOC_10引脚复用功能
 * @{
 */
#define PIOC_10_GPIO           AM_HC32_GPIO_REMAP_CODE(0x03, 0)
#define PIOC_10_LPUART1_TXD    AM_HC32_GPIO_REMAP_CODE(0x03, 1)
#define PIOC_10_LPUART0_TXD    AM_HC32_GPIO_REMAP_CODE(0x03, 2)
#define PIOC_10_PCA_CH2        AM_HC32_GPIO_REMAP_CODE(0x03, 3)

/** @} */

/**
 * \name PIOC_10引脚复用时功能模式
 * @{
 */
#define PIOC_10_INPUT_PU       AM_HC32_GPIO_MODE_CODE(0x0)   /**< \brief 上拉输入模式 (默认) */
#define PIOC_10_INPUT_PD       AM_HC32_GPIO_MODE_CODE(0x1)   /**< \brief 下拉输入模式 */
#define PIOC_10_AIN            AM_HC32_GPIO_MODE_CODE(0x2)   /**< \brief 模拟输入模式 */
#define PIOC_10_INPUT_FLOAT    AM_HC32_GPIO_MODE_CODE(0x3)   /**< \brief 浮空输入模式 */
#define PIOC_10_OUT_PP         AM_HC32_GPIO_MODE_CODE(0x4)   /**< \brief 推挽输出模式 */
#define PIOC_10_OUT_OD         AM_HC32_GPIO_MODE_CODE(0x5)   /**< \brief 开漏输出模式 */
#define PIOC_10_AOUT           AM_HC32_GPIO_MODE_CODE(0x6)   /**< \brief 模拟输出模式 */
/** @} */

/**
 * \name PIOC_11引脚复用功能
 * @{
 */
#define PIOC_11_GPIO           AM_HC32_GPIO_REMAP_CODE(0x03, 0)
#define PIOC_11_LPUART1_RXD    AM_HC32_GPIO_REMAP_CODE(0x03, 1)
#define PIOC_11_LPUART0_RXD    AM_HC32_GPIO_REMAP_CODE(0x03, 2)
#define PIOC_11_PCA_CH3        AM_HC32_GPIO_REMAP_CODE(0x03, 3)
#define PIOC_11_PCNT_S0FO      AM_HC32_GPIO_REMAP_CODE(0x03, 4)

/** @} */

/**
 * \name PIOC_11引脚复用时功能模式
 * @{
 */
#define PIOC_11_INPUT_PU       AM_HC32_GPIO_MODE_CODE(0x0)   /**< \brief 上拉输入模式 (默认) */
#define PIOC_11_INPUT_PD       AM_HC32_GPIO_MODE_CODE(0x1)   /**< \brief 下拉输入模式 */
#define PIOC_11_AIN            AM_HC32_GPIO_MODE_CODE(0x2)   /**< \brief 模拟输入模式 */
#define PIOC_11_INPUT_FLOAT    AM_HC32_GPIO_MODE_CODE(0x3)   /**< \brief 浮空输入模式 */
#define PIOC_11_OUT_PP         AM_HC32_GPIO_MODE_CODE(0x4)   /**< \brief 推挽输出模式 */
#define PIOC_11_OUT_OD         AM_HC32_GPIO_MODE_CODE(0x5)   /**< \brief 开漏输出模式 */
#define PIOC_11_AOUT           AM_HC32_GPIO_MODE_CODE(0x6)   /**< \brief 模拟输出模式 */
/** @} */

/**
 * \name PIOC_12引脚复用功能
 * @{
 */
#define PIOC_12_GPIO           AM_HC32_GPIO_REMAP_CODE(0x03, 0)
#define PIOC_12_LPUART0_TXD    AM_HC32_GPIO_REMAP_CODE(0x03, 1)
#define PIOC_12_LPUART1_TXD    AM_HC32_GPIO_REMAP_CODE(0x03, 2)
#define PIOC_12_PCA_CH4        AM_HC32_GPIO_REMAP_CODE(0x03, 3)
#define PIOC_12_PCNT_S1FO      AM_HC32_GPIO_REMAP_CODE(0x03, 4)

/** @} */

/**
 * \name PIOC_12引脚复用时功能模式
 * @{
 */
#define PIOC_12_INPUT_PU       AM_HC32_GPIO_MODE_CODE(0x0)   /**< \brief 上拉输入模式 (默认) */
#define PIOC_12_INPUT_PD       AM_HC32_GPIO_MODE_CODE(0x1)   /**< \brief 下拉输入模式 */
#define PIOC_12_AIN            AM_HC32_GPIO_MODE_CODE(0x2)   /**< \brief 模拟输入模式 */
#define PIOC_12_INPUT_FLOAT    AM_HC32_GPIO_MODE_CODE(0x3)   /**< \brief 浮空输入模式 */
#define PIOC_12_OUT_PP         AM_HC32_GPIO_MODE_CODE(0x4)   /**< \brief 推挽输出模式 */
#define PIOC_12_OUT_OD         AM_HC32_GPIO_MODE_CODE(0x5)   /**< \brief 开漏输出模式 */
#define PIOC_12_AOUT           AM_HC32_GPIO_MODE_CODE(0x6)   /**< \brief 模拟输出模式 */
/** @} */

/**
 * \name PIOC_13引脚复用功能
 * @{
 */
#define PIOC_13_GPIO           AM_HC32_GPIO_REMAP_CODE(0x03, 0)
#define PIOC_13_RTC_1HZ        AM_HC32_GPIO_REMAP_CODE(0x03, 2)
#define PIOC_13_TIM3_CH1B      AM_HC32_GPIO_REMAP_CODE(0x03, 3)

/** @} */

/**
 * \name PIOC_13引脚复用时功能模式
 * @{
 */
#define PIOC_13_INPUT_PU       AM_HC32_GPIO_MODE_CODE(0x0)   /**< \brief 上拉输入模式 (默认) */
#define PIOC_13_INPUT_PD       AM_HC32_GPIO_MODE_CODE(0x1)   /**< \brief 下拉输入模式 */
#define PIOC_13_AIN            AM_HC32_GPIO_MODE_CODE(0x2)   /**< \brief 模拟输入模式 */
#define PIOC_13_INPUT_FLOAT    AM_HC32_GPIO_MODE_CODE(0x3)   /**< \brief 浮空输入模式 */
#define PIOC_13_OUT_PP         AM_HC32_GPIO_MODE_CODE(0x4)   /**< \brief 推挽输出模式 */
#define PIOC_13_OUT_OD         AM_HC32_GPIO_MODE_CODE(0x5)   /**< \brief 开漏输出模式 */
#define PIOC_13_AOUT           AM_HC32_GPIO_MODE_CODE(0x6)   /**< \brief 模拟输出模式 */
/** @} */

/**
 * \name PIOC_14引脚复用功能
 * @{
 */
#define PIOC_14_GPIO           AM_HC32_GPIO_REMAP_CODE(0x03, 0)

/** @} */

/**
 * \name PIOC_14引脚复用时功能模式
 * @{
 */
#define PIOC_14_INPUT_PU       AM_HC32_GPIO_MODE_CODE(0x0)   /**< \brief 上拉输入模式 (默认) */
#define PIOC_14_INPUT_PD       AM_HC32_GPIO_MODE_CODE(0x1)   /**< \brief 下拉输入模式 */
#define PIOC_14_AIN            AM_HC32_GPIO_MODE_CODE(0x2)   /**< \brief 模拟输入模式 */
#define PIOC_14_INPUT_FLOAT    AM_HC32_GPIO_MODE_CODE(0x3)   /**< \brief 浮空输入模式 */
#define PIOC_14_OUT_PP         AM_HC32_GPIO_MODE_CODE(0x4)   /**< \brief 推挽输出模式 */
#define PIOC_14_OUT_OD         AM_HC32_GPIO_MODE_CODE(0x5)   /**< \brief 开漏输出模式 */
#define PIOC_14_AOUT           AM_HC32_GPIO_MODE_CODE(0x6)   /**< \brief 模拟输出模式 */
/** @} */

/**
 * \name PIOC_15引脚复用功能
 * @{
 */
#define PIOC_15_GPIO           AM_HC32_GPIO_REMAP_CODE(0x03, 0)

/** @} */

/**
 * \name PIOC_15引脚复用时功能模式
 * @{
 */
#define PIOC_15_INPUT_PU       AM_HC32_GPIO_MODE_CODE(0x0)   /**< \brief 上拉输入模式 (默认) */
#define PIOC_15_INPUT_PD       AM_HC32_GPIO_MODE_CODE(0x1)   /**< \brief 下拉输入模式 */
#define PIOC_15_AIN            AM_HC32_GPIO_MODE_CODE(0x2)   /**< \brief 模拟输入模式 */
#define PIOC_15_INPUT_FLOAT    AM_HC32_GPIO_MODE_CODE(0x3)   /**< \brief 浮空输入模式 */
#define PIOC_15_OUT_PP         AM_HC32_GPIO_MODE_CODE(0x4)   /**< \brief 推挽输出模式 */
#define PIOC_15_OUT_OD         AM_HC32_GPIO_MODE_CODE(0x5)   /**< \brief 开漏输出模式 */
#define PIOC_15_AOUT           AM_HC32_GPIO_MODE_CODE(0x6)   /**< \brief 模拟输出模式 */
/** @} */
/**
 * \name PIOD_0引脚复用功能
 * @{
 */
#define PIOD_0_GPIO           AM_HC32_GPIO_REMAP_CODE(0x04, 0)
#define PIOD_0_SPI1_CS        AM_HC32_GPIO_REMAP_CODE(0x04, 2)
/** @} */

/**
 * \name PIOD_0引脚复用时功能模式
 * @{
 */
#define PIOD_0_INPUT_PU       AM_HC32_GPIO_MODE_CODE(0x0)   /**< \brief 上拉输入模式 (默认) */
#define PIOD_0_INPUT_PD       AM_HC32_GPIO_MODE_CODE(0x1)   /**< \brief 下拉输入模式 */
#define PIOD_0_AIN            AM_HC32_GPIO_MODE_CODE(0x2)   /**< \brief 模拟输入模式 */
#define PIOD_0_INPUT_FLOAT    AM_HC32_GPIO_MODE_CODE(0x3)   /**< \brief 浮空输入模式 */
#define PIOD_0_OUT_PP         AM_HC32_GPIO_MODE_CODE(0x4)   /**< \brief 推挽输出模式 */
#define PIOD_0_OUT_OD         AM_HC32_GPIO_MODE_CODE(0x5)   /**< \brief 开漏输出模式 */
#define PIOD_0_AOUT           AM_HC32_GPIO_MODE_CODE(0x6)   /**< \brief 模拟输出模式 */
/** @} */

/**
 * \name PIOD_1引脚复用功能
 * @{
 */
#define PIOD_1_GPIO           AM_HC32_GPIO_REMAP_CODE(0x04, 0)
#define PIOD_1_SPI1_SCK       AM_HC32_GPIO_REMAP_CODE(0x04, 2)

/** @} */

/**
 * \name PIOD_1引脚复用时功能模式
 * @{
 */
#define PIOD_1_INPUT_PU       AM_HC32_GPIO_MODE_CODE(0x0)   /**< \brief 上拉输入模式 (默认) */
#define PIOD_1_INPUT_PD       AM_HC32_GPIO_MODE_CODE(0x1)   /**< \brief 下拉输入模式 */
#define PIOD_1_AIN            AM_HC32_GPIO_MODE_CODE(0x2)   /**< \brief 模拟输入模式 */
#define PIOD_1_INPUT_FLOAT    AM_HC32_GPIO_MODE_CODE(0x3)   /**< \brief 浮空输入模式 */
#define PIOD_1_OUT_PP         AM_HC32_GPIO_MODE_CODE(0x4)   /**< \brief 推挽输出模式 */
#define PIOD_1_OUT_OD         AM_HC32_GPIO_MODE_CODE(0x5)   /**< \brief 开漏输出模式 */
#define PIOD_1_AOUT           AM_HC32_GPIO_MODE_CODE(0x6)   /**< \brief 模拟输出模式 */
/** @} */

/**
 * \name PIOD_2引脚复用功能
 * @{
 */
#define PIOD_2_GPIO           AM_HC32_GPIO_REMAP_CODE(0x04, 0)
#define PIOD_2_PCA_ECI        AM_HC32_GPIO_REMAP_CODE(0x04, 1)
#define PIOD_2_LPUART0_RTS    AM_HC32_GPIO_REMAP_CODE(0x04, 2)
#define PIOD_2_TIM1_ETR       AM_HC32_GPIO_REMAP_CODE(0x04, 3)

/** @} */

/**
 * \name PIOD_2引脚复用时功能模式
 * @{
 */
#define PIOD_2_INPUT_PU       AM_HC32_GPIO_MODE_CODE(0x0)   /**< \brief 上拉输入模式 (默认) */
#define PIOD_2_INPUT_PD       AM_HC32_GPIO_MODE_CODE(0x1)   /**< \brief 下拉输入模式 */
#define PIOD_2_AIN            AM_HC32_GPIO_MODE_CODE(0x2)   /**< \brief 模拟输入模式 */
#define PIOD_2_INPUT_FLOAT    AM_HC32_GPIO_MODE_CODE(0x3)   /**< \brief 浮空输入模式 */
#define PIOD_2_OUT_PP         AM_HC32_GPIO_MODE_CODE(0x4)   /**< \brief 推挽输出模式 */
#define PIOD_2_OUT_OD         AM_HC32_GPIO_MODE_CODE(0x5)   /**< \brief 开漏输出模式 */
#define PIOD_2_AOUT           AM_HC32_GPIO_MODE_CODE(0x6)   /**< \brief 模拟输出模式 */
/** @} */

/**
 * \name PIOD_3引脚复用功能
 * @{
 */
#define PIOD_3_GPIO           AM_HC32_GPIO_REMAP_CODE(0x04, 0)
#define PIOD_3_UART1_CTS      AM_HC32_GPIO_REMAP_CODE(0x04, 1)
#define PIOD_3_SPI1_MISO      AM_HC32_GPIO_REMAP_CODE(0x04, 2)
#define PIOD_3_LPTIM1_TOG     AM_HC32_GPIO_REMAP_CODE(0x04, 3)

/** @} */

/**
 * \name PIOD_3引脚复用时功能模式
 * @{
 */
#define PIOD_3_INPUT_PU       AM_HC32_GPIO_MODE_CODE(0x0)   /**< \brief 上拉输入模式 (默认) */
#define PIOD_3_INPUT_PD       AM_HC32_GPIO_MODE_CODE(0x1)   /**< \brief 下拉输入模式 */
#define PIOD_3_AIN            AM_HC32_GPIO_MODE_CODE(0x2)   /**< \brief 模拟输入模式 */
#define PIOD_3_INPUT_FLOAT    AM_HC32_GPIO_MODE_CODE(0x3)   /**< \brief 浮空输入模式 */
#define PIOD_3_OUT_PP         AM_HC32_GPIO_MODE_CODE(0x4)   /**< \brief 推挽输出模式 */
#define PIOD_3_OUT_OD         AM_HC32_GPIO_MODE_CODE(0x5)   /**< \brief 开漏输出模式 */
#define PIOD_3_AOUT           AM_HC32_GPIO_MODE_CODE(0x6)   /**< \brief 模拟输出模式 */
/** @} */

/**
 * \name PIOD_4引脚复用功能
 * @{
 */
#define PIOD_4_GPIO           AM_HC32_GPIO_REMAP_CODE(0x04, 0)
#define PIOD_4_UART1_RTS      AM_HC32_GPIO_REMAP_CODE(0x04, 1)
#define PIOD_4_SPI1_MOSI      AM_HC32_GPIO_REMAP_CODE(0x04, 2)
#define PIOD_4_LPTIM1_TOGN    AM_HC32_GPIO_REMAP_CODE(0x04, 3)

/** @} */

/**
 * \name PIOD_4引脚复用时功能模式
 * @{
 */
#define PIOD_4_INPUT_PU       AM_HC32_GPIO_MODE_CODE(0x0)   /**< \brief 上拉输入模式 (默认) */
#define PIOD_4_INPUT_PD       AM_HC32_GPIO_MODE_CODE(0x1)   /**< \brief 下拉输入模式 */
#define PIOD_4_AIN            AM_HC32_GPIO_MODE_CODE(0x2)   /**< \brief 模拟输入模式 */
#define PIOD_4_INPUT_FLOAT    AM_HC32_GPIO_MODE_CODE(0x3)   /**< \brief 浮空输入模式 */
#define PIOD_4_OUT_PP         AM_HC32_GPIO_MODE_CODE(0x4)   /**< \brief 推挽输出模式 */
#define PIOD_4_OUT_OD         AM_HC32_GPIO_MODE_CODE(0x5)   /**< \brief 开漏输出模式 */
#define PIOD_4_AOUT           AM_HC32_GPIO_MODE_CODE(0x6)   /**< \brief 模拟输出模式 */
/** @} */

/**
 * \name PIOD_5引脚复用功能
 * @{
 */
#define PIOD_5_GPIO           AM_HC32_GPIO_REMAP_CODE(0x04, 0)
#define PIOD_5_UART1_TXD      AM_HC32_GPIO_REMAP_CODE(0x04, 1)
#define PIOD_5_LPTIM1_GATE    AM_HC32_GPIO_REMAP_CODE(0x04, 2)

/** @} */

/**
 * \name PIOD_5引脚复用时功能模式
 * @{
 */
#define PIOD_5_INPUT_PU       AM_HC32_GPIO_MODE_CODE(0x0)   /**< \brief 上拉输入模式 (默认) */
#define PIOD_5_INPUT_PD       AM_HC32_GPIO_MODE_CODE(0x1)   /**< \brief 下拉输入模式 */
#define PIOD_5_AIN            AM_HC32_GPIO_MODE_CODE(0x2)   /**< \brief 模拟输入模式 */
#define PIOD_5_INPUT_FLOAT    AM_HC32_GPIO_MODE_CODE(0x3)   /**< \brief 浮空输入模式 */
#define PIOD_5_OUT_PP         AM_HC32_GPIO_MODE_CODE(0x4)   /**< \brief 推挽输出模式 */
#define PIOD_5_OUT_OD         AM_HC32_GPIO_MODE_CODE(0x5)   /**< \brief 开漏输出模式 */
#define PIOD_5_AOUT           AM_HC32_GPIO_MODE_CODE(0x6)   /**< \brief 模拟输出模式 */
/** @} */

/**
 * \name PIOD_6引脚复用功能
 * @{
 */
#define PIOD_6_GPIO           AM_HC32_GPIO_REMAP_CODE(0x04, 0)
#define PIOD_6_UART1_RXD      AM_HC32_GPIO_REMAP_CODE(0x04, 1)
#define PIOD_6_LPTIM1_ETR     AM_HC32_GPIO_REMAP_CODE(0x04, 2)

/** @} */

/**
 * \name PIOD_6引脚复用时功能模式
 * @{
 */
#define PIOD_6_INPUT_PU       AM_HC32_GPIO_MODE_CODE(0x0)   /**< \brief 上拉输入模式 (默认) */
#define PIOD_6_INPUT_PD       AM_HC32_GPIO_MODE_CODE(0x1)   /**< \brief 下拉输入模式 */
#define PIOD_6_AIN            AM_HC32_GPIO_MODE_CODE(0x2)   /**< \brief 模拟输入模式 */
#define PIOD_6_INPUT_FLOAT    AM_HC32_GPIO_MODE_CODE(0x3)   /**< \brief 浮空输入模式 */
#define PIOD_6_OUT_PP         AM_HC32_GPIO_MODE_CODE(0x4)   /**< \brief 推挽输出模式 */
#define PIOD_6_OUT_OD         AM_HC32_GPIO_MODE_CODE(0x5)   /**< \brief 开漏输出模式 */
#define PIOD_6_AOUT           AM_HC32_GPIO_MODE_CODE(0x6)   /**< \brief 模拟输出模式 */
/** @} */

/**
 * \name PIOD_7引脚复用功能
 * @{
 */
#define PIOD_7_GPIO           AM_HC32_GPIO_REMAP_CODE(0x04, 0)
#define PIOD_7_UART1_TXD      AM_HC32_GPIO_REMAP_CODE(0x04, 1)

/** @} */

/**
 * \name PIOD_7引脚复用时功能模式
 * @{
 */
#define PIOD_7_INPUT_PU       AM_HC32_GPIO_MODE_CODE(0x0)   /**< \brief 上拉输入模式 (默认) */
#define PIOD_7_INPUT_PD       AM_HC32_GPIO_MODE_CODE(0x1)   /**< \brief 下拉输入模式 */
#define PIOD_7_AIN            AM_HC32_GPIO_MODE_CODE(0x2)   /**< \brief 模拟输入模式 */
#define PIOD_7_INPUT_FLOAT    AM_HC32_GPIO_MODE_CODE(0x3)   /**< \brief 浮空输入模式 */
#define PIOD_7_OUT_PP         AM_HC32_GPIO_MODE_CODE(0x4)   /**< \brief 推挽输出模式 */
#define PIOD_7_OUT_OD         AM_HC32_GPIO_MODE_CODE(0x5)   /**< \brief 开漏输出模式 */
#define PIOD_7_AOUT           AM_HC32_GPIO_MODE_CODE(0x6)   /**< \brief 模拟输出模式 */
/** @} */

/**
 * \name PIOD_8引脚复用功能
 * @{
 */
#define PIOD_8_GPIO           AM_HC32_GPIO_REMAP_CODE(0x04, 0)
#define PIOD_8_LPUART0_TXD    AM_HC32_GPIO_REMAP_CODE(0x04, 1)

/** @} */

/**
 * \name PIOD_8引脚复用时功能模式
 * @{
 */
#define PIOD_8_INPUT_PU       AM_HC32_GPIO_MODE_CODE(0x0)   /**< \brief 上拉输入模式 (默认) */
#define PIOD_8_INPUT_PD       AM_HC32_GPIO_MODE_CODE(0x1)   /**< \brief 下拉输入模式 */
#define PIOD_8_AIN            AM_HC32_GPIO_MODE_CODE(0x2)   /**< \brief 模拟输入模式 */
#define PIOD_8_INPUT_FLOAT    AM_HC32_GPIO_MODE_CODE(0x3)   /**< \brief 浮空输入模式 */
#define PIOD_8_OUT_PP         AM_HC32_GPIO_MODE_CODE(0x4)   /**< \brief 推挽输出模式 */
#define PIOD_8_OUT_OD         AM_HC32_GPIO_MODE_CODE(0x5)   /**< \brief 开漏输出模式 */
#define PIOD_8_AOUT           AM_HC32_GPIO_MODE_CODE(0x6)   /**< \brief 模拟输出模式 */
/** @} */

/**
 * \name PIOD_9引脚复用功能
 * @{
 */
#define PIOD_9_GPIO           AM_HC32_GPIO_REMAP_CODE(0x04, 0)
#define PIOD_9_LPUART0_RXD    AM_HC32_GPIO_REMAP_CODE(0x04, 1)

/** @} */

/**
 * \name PIOD_9引脚复用时功能模式
 * @{
 */
#define PIOD_9_INPUT_PU       AM_HC32_GPIO_MODE_CODE(0x0)   /**< \brief 上拉输入模式 (默认) */
#define PIOD_9_INPUT_PD       AM_HC32_GPIO_MODE_CODE(0x1)   /**< \brief 下拉输入模式 */
#define PIOD_9_AIN            AM_HC32_GPIO_MODE_CODE(0x2)   /**< \brief 模拟输入模式 */
#define PIOD_9_INPUT_FLOAT    AM_HC32_GPIO_MODE_CODE(0x3)   /**< \brief 浮空输入模式 */
#define PIOD_9_OUT_PP         AM_HC32_GPIO_MODE_CODE(0x4)   /**< \brief 推挽输出模式 */
#define PIOD_9_OUT_OD         AM_HC32_GPIO_MODE_CODE(0x5)   /**< \brief 开漏输出模式 */
#define PIOD_9_AOUT           AM_HC32_GPIO_MODE_CODE(0x6)   /**< \brief 模拟输出模式 */
/** @} */

/**
 * \name PIOD_10引脚复用功能
 * @{
 */
#define PIOD_10_GPIO           AM_HC32_GPIO_REMAP_CODE(0x04, 0)
#define PIOD_10_LPUART0_TXD    AM_HC32_GPIO_REMAP_CODE(0x04, 1)

/** @} */

/**
 * \name PIOD_10引脚复用时功能模式
 * @{
 */
#define PIOD_10_INPUT_PU       AM_HC32_GPIO_MODE_CODE(0x0)   /**< \brief 上拉输入模式 (默认) */
#define PIOD_10_INPUT_PD       AM_HC32_GPIO_MODE_CODE(0x1)   /**< \brief 下拉输入模式 */
#define PIOD_10_AIN            AM_HC32_GPIO_MODE_CODE(0x2)   /**< \brief 模拟输入模式 */
#define PIOD_10_INPUT_FLOAT    AM_HC32_GPIO_MODE_CODE(0x3)   /**< \brief 浮空输入模式 */
#define PIOD_10_OUT_PP         AM_HC32_GPIO_MODE_CODE(0x4)   /**< \brief 推挽输出模式 */
#define PIOD_10_OUT_OD         AM_HC32_GPIO_MODE_CODE(0x5)   /**< \brief 开漏输出模式 */
#define PIOD_10_AOUT           AM_HC32_GPIO_MODE_CODE(0x6)   /**< \brief 模拟输出模式 */
/** @} */

/**
 * \name PIOD_11引脚复用功能
 * @{
 */
#define PIOD_11_GPIO           AM_HC32_GPIO_REMAP_CODE(0x04, 0)
#define PIOD_11_LPUART0_CTS    AM_HC32_GPIO_REMAP_CODE(0x04, 1)

/** @} */

/**
 * \name PIOD_11引脚复用时功能模式
 * @{
 */
#define PIOD_11_INPUT_PU       AM_HC32_GPIO_MODE_CODE(0x0)   /**< \brief 上拉输入模式 (默认) */
#define PIOD_11_INPUT_PD       AM_HC32_GPIO_MODE_CODE(0x1)   /**< \brief 下拉输入模式 */
#define PIOD_11_AIN            AM_HC32_GPIO_MODE_CODE(0x2)   /**< \brief 模拟输入模式 */
#define PIOD_11_INPUT_FLOAT    AM_HC32_GPIO_MODE_CODE(0x3)   /**< \brief 浮空输入模式 */
#define PIOD_11_OUT_PP         AM_HC32_GPIO_MODE_CODE(0x4)   /**< \brief 推挽输出模式 */
#define PIOD_11_OUT_OD         AM_HC32_GPIO_MODE_CODE(0x5)   /**< \brief 开漏输出模式 */
#define PIOD_11_AOUT           AM_HC32_GPIO_MODE_CODE(0x6)   /**< \brief 模拟输出模式 */
/** @} */

/**
 * \name PIOD_12引脚复用功能
 * @{
 */
#define PIOD_12_GPIO           AM_HC32_GPIO_REMAP_CODE(0x04, 0)
#define PIOD_12_LPUART0_RTS    AM_HC32_GPIO_REMAP_CODE(0x04, 1)
#define PIOD_12_UART2_RTS      AM_HC32_GPIO_REMAP_CODE(0x04, 2)

/** @} */

