zlgopen/ametal/soc/hdsc/hc32/hc32_pin.h
/**
 * \name PIOD_12引脚复用时功能模式
 * @{
 */
#define PIOD_12_INPUT_PU       AM_HC32_GPIO_MODE_CODE(0x0)   /**< \brief 上拉输入模式 (默认) */
#define PIOD_12_INPUT_PD       AM_HC32_GPIO_MODE_CODE(0x1)   /**< \brief 下拉输入模式 */
#define PIOD_12_AIN            AM_HC32_GPIO_MODE_CODE(0x2)   /**< \brief 模拟输入模式 */
#define PIOD_12_INPUT_FLOAT    AM_HC32_GPIO_MODE_CODE(0x3)   /**< \brief 浮空输入模式 */
#define PIOD_12_OUT_PP         AM_HC32_GPIO_MODE_CODE(0x4)   /**< \brief 推挽输出模式 */
#define PIOD_12_OUT_OD         AM_HC32_GPIO_MODE_CODE(0x5)   /**< \brief 开漏输出模式 */
#define PIOD_12_AOUT           AM_HC32_GPIO_MODE_CODE(0x6)   /**< \brief 模拟输出模式 */
/** @} */

/**
 * \name PIOD_13引脚复用功能
 * @{
 */
#define PIOD_13_GPIO           AM_HC32_GPIO_REMAP_CODE(0x04, 0)
#define PIOD_13_UART2_RXD      AM_HC32_GPIO_REMAP_CODE(0x04, 1)

/** @} */

/**
 * \name PIOD_13引脚复用时功能模式
 * @{
 */
#define PIOD_13_INPUT_PU       AM_HC32_GPIO_MODE_CODE(0x0)   /**< \brief 上拉输入模式 (默认) */
#define PIOD_13_INPUT_PD       AM_HC32_GPIO_MODE_CODE(0x1)   /**< \brief 下拉输入模式 */
#define PIOD_13_AIN            AM_HC32_GPIO_MODE_CODE(0x2)   /**< \brief 模拟输入模式 */
#define PIOD_13_INPUT_FLOAT    AM_HC32_GPIO_MODE_CODE(0x3)   /**< \brief 浮空输入模式 */
#define PIOD_13_OUT_PP         AM_HC32_GPIO_MODE_CODE(0x4)   /**< \brief 推挽输出模式 */
#define PIOD_13_OUT_OD         AM_HC32_GPIO_MODE_CODE(0x5)   /**< \brief 开漏输出模式 */
#define PIOD_13_AOUT           AM_HC32_GPIO_MODE_CODE(0x6)   /**< \brief 模拟输出模式 */
/** @} */

/**
 * \name PIOD_14引脚复用功能
 * @{
 */
#define PIOD_14_GPIO           AM_HC32_GPIO_REMAP_CODE(0x04, 0)
#define PIOD_14_UART2_TXD      AM_HC32_GPIO_REMAP_CODE(0x04, 1)

/** @} */

/**
 * \name PIOD_14引脚复用时功能模式
 * @{
 */
#define PIOD_14_INPUT_PU       AM_HC32_GPIO_MODE_CODE(0x0)   /**< \brief 上拉输入模式 (默认) */
#define PIOD_14_INPUT_PD       AM_HC32_GPIO_MODE_CODE(0x1)   /**< \brief 下拉输入模式 */
#define PIOD_14_AIN            AM_HC32_GPIO_MODE_CODE(0x2)   /**< \brief 模拟输入模式 */
#define PIOD_14_INPUT_FLOAT    AM_HC32_GPIO_MODE_CODE(0x3)   /**< \brief 浮空输入模式 */
#define PIOD_14_OUT_PP         AM_HC32_GPIO_MODE_CODE(0x4)   /**< \brief 推挽输出模式 */
#define PIOD_14_OUT_OD         AM_HC32_GPIO_MODE_CODE(0x5)   /**< \brief 开漏输出模式 */
#define PIOD_14_AOUT           AM_HC32_GPIO_MODE_CODE(0x6)   /**< \brief 模拟输出模式 */
/** @} */

/**
 * \name PIOD_15引脚复用功能
 * @{
 */
#define PIOD_15_GPIO           AM_HC32_GPIO_REMAP_CODE(0x04, 0)
#define PIOD_15_UART2_CTS      AM_HC32_GPIO_REMAP_CODE(0x04, 2)

/** @} */

/**
 * \name PIOD_15引脚复用时功能模式
 * @{
 */
#define PIOD_15_INPUT_PU       AM_HC32_GPIO_MODE_CODE(0x0)   /**< \brief 上拉输入模式 (默认) */
#define PIOD_15_INPUT_PD       AM_HC32_GPIO_MODE_CODE(0x1)   /**< \brief 下拉输入模式 */
#define PIOD_15_AIN            AM_HC32_GPIO_MODE_CODE(0x2)   /**< \brief 模拟输入模式 */
#define PIOD_15_INPUT_FLOAT    AM_HC32_GPIO_MODE_CODE(0x3)   /**< \brief 浮空输入模式 */
#define PIOD_15_OUT_PP         AM_HC32_GPIO_MODE_CODE(0x4)   /**< \brief 推挽输出模式 */
#define PIOD_15_OUT_OD         AM_HC32_GPIO_MODE_CODE(0x5)   /**< \brief 开漏输出模式 */
#define PIOD_15_AOUT           AM_HC32_GPIO_MODE_CODE(0x6)   /**< \brief 模拟输出模式 */
/** @} */

/**
 * \name PIOE_0引脚复用功能
 * @{
 */
#define PIOE_0_GPIO           AM_HC32_GPIO_REMAP_CODE(0x05, 0)
#define PIOE_0_TIM1_CHA       AM_HC32_GPIO_REMAP_CODE(0x05, 1)

/** @} */

/**
 * \name PIOE_0引脚复用时功能模式
 * @{
 */
#define PIOE_0_INPUT_PU       AM_HC32_GPIO_MODE_CODE(0x0)   /**< \brief 上拉输入模式 (默认) */
#define PIOE_0_INPUT_PD       AM_HC32_GPIO_MODE_CODE(0x1)   /**< \brief 下拉输入模式 */
#define PIOE_0_AIN            AM_HC32_GPIO_MODE_CODE(0x2)   /**< \brief 模拟输入模式 */
#define PIOE_0_INPUT_FLOAT    AM_HC32_GPIO_MODE_CODE(0x3)   /**< \brief 浮空输入模式 */
#define PIOE_0_OUT_PP         AM_HC32_GPIO_MODE_CODE(0x4)   /**< \brief 推挽输出模式 */
#define PIOE_0_OUT_OD         AM_HC32_GPIO_MODE_CODE(0x5)   /**< \brief 开漏输出模式 */
#define PIOE_0_AOUT           AM_HC32_GPIO_MODE_CODE(0x6)   /**< \brief 模拟输出模式 */
/** @} */

/**
 * \name PIOE_1引脚复用功能
 * @{
 */
#define PIOE_1_GPIO           AM_HC32_GPIO_REMAP_CODE(0x05, 0)
#define PIOE_1_TIM2_CHA       AM_HC32_GPIO_REMAP_CODE(0x05, 1)

/** @} */

/**
 * \name PIOE_1引脚复用时功能模式
 * @{
 */
#define PIOE_1_INPUT_PU       AM_HC32_GPIO_MODE_CODE(0x0)   /**< \brief 上拉输入模式 (默认) */
#define PIOE_1_INPUT_PD       AM_HC32_GPIO_MODE_CODE(0x1)   /**< \brief 下拉输入模式 */
#define PIOE_1_AIN            AM_HC32_GPIO_MODE_CODE(0x2)   /**< \brief 模拟输入模式 */
#define PIOE_1_INPUT_FLOAT    AM_HC32_GPIO_MODE_CODE(0x3)   /**< \brief 浮空输入模式 */
#define PIOE_1_OUT_PP         AM_HC32_GPIO_MODE_CODE(0x4)   /**< \brief 推挽输出模式 */
#define PIOE_1_OUT_OD         AM_HC32_GPIO_MODE_CODE(0x5)   /**< \brief 开漏输出模式 */
#define PIOE_1_AOUT           AM_HC32_GPIO_MODE_CODE(0x6)   /**< \brief 模拟输出模式 */
/** @} */

/**
 * \name PIOE_2引脚复用功能
 * @{
 */
#define PIOE_2_GPIO           AM_HC32_GPIO_REMAP_CODE(0x05, 0)
#define PIOE_2_PCA_ECI        AM_HC32_GPIO_REMAP_CODE(0x05, 1)

/** @} */

/**
 * \name PIOE_2引脚复用时功能模式
 * @{
 */
#define PIOE_2_INPUT_PU       AM_HC32_GPIO_MODE_CODE(0x0)   /**< \brief 上拉输入模式 (默认) */
#define PIOE_2_INPUT_PD       AM_HC32_GPIO_MODE_CODE(0x1)   /**< \brief 下拉输入模式 */
#define PIOE_2_AIN            AM_HC32_GPIO_MODE_CODE(0x2)   /**< \brief 模拟输入模式 */
#define PIOE_2_INPUT_FLOAT    AM_HC32_GPIO_MODE_CODE(0x3)   /**< \brief 浮空输入模式 */
#define PIOE_2_OUT_PP         AM_HC32_GPIO_MODE_CODE(0x4)   /**< \brief 推挽输出模式 */
#define PIOE_2_OUT_OD         AM_HC32_GPIO_MODE_CODE(0x5)   /**< \brief 开漏输出模式 */
#define PIOE_2_AOUT           AM_HC32_GPIO_MODE_CODE(0x6)   /**< \brief 模拟输出模式 */
/** @} */

/**
 * \name PIOE_3引脚复用功能
 * @{
 */
#define PIOE_3_GPIO           AM_HC32_GPIO_REMAP_CODE(0x05, 0)
#define PIOE_3_PCA_CH0        AM_HC32_GPIO_REMAP_CODE(0x05, 1)

/** @} */

/**
 * \name PIOE_3引脚复用时功能模式
 * @{
 */
#define PIOE_3_INPUT_PU       AM_HC32_GPIO_MODE_CODE(0x0)   /**< \brief 上拉输入模式 (默认) */
#define PIOE_3_INPUT_PD       AM_HC32_GPIO_MODE_CODE(0x1)   /**< \brief 下拉输入模式 */
#define PIOE_3_AIN            AM_HC32_GPIO_MODE_CODE(0x2)   /**< \brief 模拟输入模式 */
#define PIOE_3_INPUT_FLOAT    AM_HC32_GPIO_MODE_CODE(0x3)   /**< \brief 浮空输入模式 */
#define PIOE_3_OUT_PP         AM_HC32_GPIO_MODE_CODE(0x4)   /**< \brief 推挽输出模式 */
#define PIOE_3_OUT_OD         AM_HC32_GPIO_MODE_CODE(0x5)   /**< \brief 开漏输出模式 */
#define PIOE_3_AOUT           AM_HC32_GPIO_MODE_CODE(0x6)   /**< \brief 模拟输出模式 */
/** @} */

/**
 * \name PIOE_4引脚复用功能
 * @{
 */
#define PIOE_4_GPIO           AM_HC32_GPIO_REMAP_CODE(0x05, 0)
#define PIOE_4_PCA_CH1        AM_HC32_GPIO_REMAP_CODE(0x05, 1)

/** @} */

/**
 * \name PIOE_4引脚复用时功能模式
 * @{
 */
#define PIOE_4_INPUT_PU       AM_HC32_GPIO_MODE_CODE(0x0)   /**< \brief 上拉输入模式 (默认) */
#define PIOE_4_INPUT_PD       AM_HC32_GPIO_MODE_CODE(0x1)   /**< \brief 下拉输入模式 */
#define PIOE_4_AIN            AM_HC32_GPIO_MODE_CODE(0x2)   /**< \brief 模拟输入模式 */
#define PIOE_4_INPUT_FLOAT    AM_HC32_GPIO_MODE_CODE(0x3)   /**< \brief 浮空输入模式 */
#define PIOE_4_OUT_PP         AM_HC32_GPIO_MODE_CODE(0x4)   /**< \brief 推挽输出模式 */
#define PIOE_4_OUT_OD         AM_HC32_GPIO_MODE_CODE(0x5)   /**< \brief 开漏输出模式 */
#define PIOE_4_AOUT           AM_HC32_GPIO_MODE_CODE(0x6)   /**< \brief 模拟输出模式 */
/** @} */

/**
 * \name PIOE_5引脚复用功能
 * @{
 */
#define PIOE_5_GPIO           AM_HC32_GPIO_REMAP_CODE(0x05, 0)
#define PIOE_5_PCA_CH2        AM_HC32_GPIO_REMAP_CODE(0x05, 1)

/** @} */

/**
 * \name PIOE_5引脚复用时功能模式
 * @{
 */
#define PIOE_5_INPUT_PU       AM_HC32_GPIO_MODE_CODE(0x0)   /**< \brief 上拉输入模式 (默认) */
#define PIOE_5_INPUT_PD       AM_HC32_GPIO_MODE_CODE(0x1)   /**< \brief 下拉输入模式 */
#define PIOE_5_AIN            AM_HC32_GPIO_MODE_CODE(0x2)   /**< \brief 模拟输入模式 */
#define PIOE_5_INPUT_FLOAT    AM_HC32_GPIO_MODE_CODE(0x3)   /**< \brief 浮空输入模式 */
#define PIOE_5_OUT_PP         AM_HC32_GPIO_MODE_CODE(0x4)   /**< \brief 推挽输出模式 */
#define PIOE_5_OUT_OD         AM_HC32_GPIO_MODE_CODE(0x5)   /**< \brief 开漏输出模式 */
#define PIOE_5_AOUT           AM_HC32_GPIO_MODE_CODE(0x6)   /**< \brief 模拟输出模式 */
/** @} */
/**
 * \name PIOE_6引脚复用功能
 * @{
 */
#define PIOE_6_GPIO           AM_HC32_GPIO_REMAP_CODE(0x05, 0)
#define PIOE_6_PCA_CH3        AM_HC32_GPIO_REMAP_CODE(0x05, 1)

/** @} */

/**
 * \name PIOE_6引脚复用时功能模式
 * @{
 */
#define PIOE_6_INPUT_PU       AM_HC32_GPIO_MODE_CODE(0x0)   /**< \brief 上拉输入模式 (默认) */
#define PIOE_6_INPUT_PD       AM_HC32_GPIO_MODE_CODE(0x1)   /**< \brief 下拉输入模式 */
#define PIOE_6_AIN            AM_HC32_GPIO_MODE_CODE(0x2)   /**< \brief 模拟输入模式 */
#define PIOE_6_INPUT_FLOAT    AM_HC32_GPIO_MODE_CODE(0x3)   /**< \brief 浮空输入模式 */
#define PIOE_6_OUT_PP         AM_HC32_GPIO_MODE_CODE(0x4)   /**< \brief 推挽输出模式 */
#define PIOE_6_OUT_OD         AM_HC32_GPIO_MODE_CODE(0x5)   /**< \brief 开漏输出模式 */
#define PIOE_6_AOUT           AM_HC32_GPIO_MODE_CODE(0x6)   /**< \brief 模拟输出模式 */
/** @} */
/**
 * \name PIOE_7引脚复用功能
 * @{
 */
#define PIOE_7_GPIO           AM_HC32_GPIO_REMAP_CODE(0x05, 0)
#define PIOE_7_TIM3_ETR       AM_HC32_GPIO_REMAP_CODE(0x05, 1)
#define PIOE_7_LPTIM1_GATE    AM_HC32_GPIO_REMAP_CODE(0x05, 2)
/** @} */

/**
 * \name PIOE_7引脚复用时功能模式
 * @{
 */
#define PIOE_7_INPUT_PU       AM_HC32_GPIO_MODE_CODE(0x0)   /**< \brief 上拉输入模式 (默认) */
#define PIOE_7_INPUT_PD       AM_HC32_GPIO_MODE_CODE(0x1)   /**< \brief 下拉输入模式 */
#define PIOE_7_AIN            AM_HC32_GPIO_MODE_CODE(0x2)   /**< \brief 模拟输入模式 */
#define PIOE_7_INPUT_FLOAT    AM_HC32_GPIO_MODE_CODE(0x3)   /**< \brief 浮空输入模式 */
#define PIOE_7_OUT_PP         AM_HC32_GPIO_MODE_CODE(0x4)   /**< \brief 推挽输出模式 */
#define PIOE_7_OUT_OD         AM_HC32_GPIO_MODE_CODE(0x5)   /**< \brief 开漏输出模式 */
#define PIOE_7_AOUT           AM_HC32_GPIO_MODE_CODE(0x6)   /**< \brief 模拟输出模式 */
/** @} */

/**
 * \name PIOE_8引脚复用功能
 * @{
 */
#define PIOE_8_GPIO           AM_HC32_GPIO_REMAP_CODE(0x05, 0)
#define PIOE_8_TIM3_CH0B      AM_HC32_GPIO_REMAP_CODE(0x05, 1)
#define PIOE_8_LPTIM1_ETR     AM_HC32_GPIO_REMAP_CODE(0x05, 2)
/** @} */

/**
 * \name PIOE_8引脚复用时功能模式
 * @{
 */
#define PIOE_8_INPUT_PU       AM_HC32_GPIO_MODE_CODE(0x0)   /**< \brief 上拉输入模式 (默认) */
#define PIOE_8_INPUT_PD       AM_HC32_GPIO_MODE_CODE(0x1)   /**< \brief 下拉输入模式 */
#define PIOE_8_AIN            AM_HC32_GPIO_MODE_CODE(0x2)   /**< \brief 模拟输入模式 */
#define PIOE_8_INPUT_FLOAT    AM_HC32_GPIO_MODE_CODE(0x3)   /**< \brief 浮空输入模式 */
#define PIOE_8_OUT_PP         AM_HC32_GPIO_MODE_CODE(0x4)   /**< \brief 推挽输出模式 */
#define PIOE_8_OUT_OD         AM_HC32_GPIO_MODE_CODE(0x5)   /**< \brief 开漏输出模式 */
#define PIOE_8_AOUT           AM_HC32_GPIO_MODE_CODE(0x6)   /**< \brief 模拟输出模式 */
/** @} */

/**
 * \name PIOE_9引脚复用功能
 * @{
 */
#define PIOE_9_GPIO           AM_HC32_GPIO_REMAP_CODE(0x05, 0)
#define PIOE_9_TIM3_CH0A      AM_HC32_GPIO_REMAP_CODE(0x05, 1)
#define PIOE_9_LPTIM1_TOG     AM_HC32_GPIO_REMAP_CODE(0x05, 2)
/** @} */

/**
 * \name PIOE_9引脚复用时功能模式
 * @{
 */
#define PIOE_9_INPUT_PU       AM_HC32_GPIO_MODE_CODE(0x0)   /**< \brief 上拉输入模式 (默认) */
#define PIOE_9_INPUT_PD       AM_HC32_GPIO_MODE_CODE(0x1)   /**< \brief 下拉输入模式 */
#define PIOE_9_AIN            AM_HC32_GPIO_MODE_CODE(0x2)   /**< \brief 模拟输入模式 */
#define PIOE_9_INPUT_FLOAT    AM_HC32_GPIO_MODE_CODE(0x3)   /**< \brief 浮空输入模式 */
#define PIOE_9_OUT_PP         AM_HC32_GPIO_MODE_CODE(0x4)   /**< \brief 推挽输出模式 */
#define PIOE_9_OUT_OD         AM_HC32_GPIO_MODE_CODE(0x5)   /**< \brief 开漏输出模式 */
#define PIOE_9_AOUT           AM_HC32_GPIO_MODE_CODE(0x6)   /**< \brief 模拟输出模式 */
/** @} */

/**
 * \name PIOE_10引脚复用功能
 * @{
 */
#define PIOE_10_GPIO           AM_HC32_GPIO_REMAP_CODE(0x05, 0)
#define PIOE_10_TIM3_CH1B      AM_HC32_GPIO_REMAP_CODE(0x05, 1)
#define PIOE_10_LPTIM1_TOGN     AM_HC32_GPIO_REMAP_CODE(0x05, 2)
/** @} */

/**
 * \name PIOE_10引脚复用时功能模式
 * @{
 */
#define PIOE_10_INPUT_PU       AM_HC32_GPIO_MODE_CODE(0x0)   /**< \brief 上拉输入模式 (默认) */
#define PIOE_10_INPUT_PD       AM_HC32_GPIO_MODE_CODE(0x1)   /**< \brief 下拉输入模式 */
#define PIOE_10_AIN            AM_HC32_GPIO_MODE_CODE(0x2)   /**< \brief 模拟输入模式 */
#define PIOE_10_INPUT_FLOAT    AM_HC32_GPIO_MODE_CODE(0x3)   /**< \brief 浮空输入模式 */
#define PIOE_10_OUT_PP         AM_HC32_GPIO_MODE_CODE(0x4)   /**< \brief 推挽输出模式 */
#define PIOE_10_OUT_OD         AM_HC32_GPIO_MODE_CODE(0x5)   /**< \brief 开漏输出模式 */
#define PIOE_10_AOUT           AM_HC32_GPIO_MODE_CODE(0x6)   /**< \brief 模拟输出模式 */
/** @} */
/**
 * \name PIOE_11引脚复用功能
 * @{
 */
#define PIOE_11_GPIO           AM_HC32_GPIO_REMAP_CODE(0x05, 0)
#define PIOE_11_TIM3_CH1A      AM_HC32_GPIO_REMAP_CODE(0x05, 1)
/** @} */

/**
 * \name PIOE_11引脚复用时功能模式
 * @{
 */
#define PIOE_11_INPUT_PU       AM_HC32_GPIO_MODE_CODE(0x0)   /**< \brief 上拉输入模式 (默认) */
#define PIOE_11_INPUT_PD       AM_HC32_GPIO_MODE_CODE(0x1)   /**< \brief 下拉输入模式 */
#define PIOE_11_AIN            AM_HC32_GPIO_MODE_CODE(0x2)   /**< \brief 模拟输入模式 */
#define PIOE_11_INPUT_FLOAT    AM_HC32_GPIO_MODE_CODE(0x3)   /**< \brief 浮空输入模式 */
#define PIOE_11_OUT_PP         AM_HC32_GPIO_MODE_CODE(0x4)   /**< \brief 推挽输出模式 */
#define PIOE_11_OUT_OD         AM_HC32_GPIO_MODE_CODE(0x5)   /**< \brief 开漏输出模式 */
#define PIOE_11_AOUT           AM_HC32_GPIO_MODE_CODE(0x6)   /**< \brief 模拟输出模式 */
/** @} */

/**
 * \name PIOE_12引脚复用功能
 * @{
 */
#define PIOE_12_GPIO           AM_HC32_GPIO_REMAP_CODE(0x05, 0)
#define PIOE_12_TIM3_CH2B      AM_HC32_GPIO_REMAP_CODE(0x05, 1)
#define PIOE_12_SPI0_CS        AM_HC32_GPIO_REMAP_CODE(0x05, 2)
#define PIOE_12_UART3_CTS      AM_HC32_GPIO_REMAP_CODE(0x05, 3)

/** @} */

/**
 * \name PIOE_12引脚复用时功能模式
 * @{
 */
#define PIOE_12_INPUT_PU       AM_HC32_GPIO_MODE_CODE(0x0)   /**< \brief 上拉输入模式 (默认) */
#define PIOE_12_INPUT_PD       AM_HC32_GPIO_MODE_CODE(0x1)   /**< \brief 下拉输入模式 */
#define PIOE_12_AIN            AM_HC32_GPIO_MODE_CODE(0x2)   /**< \brief 模拟输入模式 */
#define PIOE_12_INPUT_FLOAT    AM_HC32_GPIO_MODE_CODE(0x3)   /**< \brief 浮空输入模式 */
#define PIOE_12_OUT_PP         AM_HC32_GPIO_MODE_CODE(0x4)   /**< \brief 推挽输出模式 */
#define PIOE_12_OUT_OD         AM_HC32_GPIO_MODE_CODE(0x5)   /**< \brief 开漏输出模式 */
#define PIOE_12_AOUT           AM_HC32_GPIO_MODE_CODE(0x6)   /**< \brief 模拟输出模式 */
/** @} */

/**
 * \name PIOE_13引脚复用功能
 * @{
 */
#define PIOE_13_GPIO           AM_HC32_GPIO_REMAP_CODE(0x05, 0)
#define PIOE_13_TIM3_CH2A      AM_HC32_GPIO_REMAP_CODE(0x05, 1)
#define PIOE_13_SPI0_SCK       AM_HC32_GPIO_REMAP_CODE(0x05, 2)
#define PIOE_13_UART3_RTS      AM_HC32_GPIO_REMAP_CODE(0x05, 3)

/** @} */

/**
 * \name PIOE_13引脚复用时功能模式
 * @{
 */
#define PIOE_13_INPUT_PU       AM_HC32_GPIO_MODE_CODE(0x0)   /**< \brief 上拉输入模式 (默认) */
#define PIOE_13_INPUT_PD       AM_HC32_GPIO_MODE_CODE(0x1)   /**< \brief 下拉输入模式 */
#define PIOE_13_AIN            AM_HC32_GPIO_MODE_CODE(0x2)   /**< \brief 模拟输入模式 */
#define PIOE_13_INPUT_FLOAT    AM_HC32_GPIO_MODE_CODE(0x3)   /**< \brief 浮空输入模式 */
#define PIOE_13_OUT_PP         AM_HC32_GPIO_MODE_CODE(0x4)   /**< \brief 推挽输出模式 */
#define PIOE_13_OUT_OD         AM_HC32_GPIO_MODE_CODE(0x5)   /**< \brief 开漏输出模式 */
#define PIOE_13_AOUT           AM_HC32_GPIO_MODE_CODE(0x6)   /**< \brief 模拟输出模式 */
/** @} */

/**
 * \name PIOE_14引脚复用功能
 * @{
 */
#define PIOE_14_GPIO           AM_HC32_GPIO_REMAP_CODE(0x05, 0)
#define PIOE_14_TIM3_CH0B      AM_HC32_GPIO_REMAP_CODE(0x05, 1)
#define PIOE_14_SPI0_MISO      AM_HC32_GPIO_REMAP_CODE(0x05, 2)
#define PIOE_14_UART3_RXD      AM_HC32_GPIO_REMAP_CODE(0x05, 3)

/** @} */

/**
 * \name PIOE_14引脚复用时功能模式
 * @{
 */
#define PIOE_14_INPUT_PU       AM_HC32_GPIO_MODE_CODE(0x0)   /**< \brief 上拉输入模式 (默认) */
#define PIOE_14_INPUT_PD       AM_HC32_GPIO_MODE_CODE(0x1)   /**< \brief 下拉输入模式 */
#define PIOE_14_AIN            AM_HC32_GPIO_MODE_CODE(0x2)   /**< \brief 模拟输入模式 */
#define PIOE_14_INPUT_FLOAT    AM_HC32_GPIO_MODE_CODE(0x3)   /**< \brief 浮空输入模式 */
#define PIOE_14_OUT_PP         AM_HC32_GPIO_MODE_CODE(0x4)   /**< \brief 推挽输出模式 */
#define PIOE_14_OUT_OD         AM_HC32_GPIO_MODE_CODE(0x5)   /**< \brief 开漏输出模式 */
#define PIOE_14_AOUT           AM_HC32_GPIO_MODE_CODE(0x6)   /**< \brief 模拟输出模式 */
/** @} */

/**
 * \name PIOE_15引脚复用功能
 * @{
 */
#define PIOE_15_GPIO           AM_HC32_GPIO_REMAP_CODE(0x05, 0)
#define PIOE_15_TIM3_BK        AM_HC32_GPIO_REMAP_CODE(0x05, 1)
#define PIOE_15_SPI0_MOSI      AM_HC32_GPIO_REMAP_CODE(0x05, 2)
#define PIOE_15_UART3_TXD      AM_HC32_GPIO_REMAP_CODE(0x05, 3)

/** @} */

/**
 * \name PIOE_15引脚复用时功能模式
 * @{
 */
#define PIOE_15_INPUT_PU       AM_HC32_GPIO_MODE_CODE(0x0)   /**< \brief 上拉输入模式 (默认) */
#define PIOE_15_INPUT_PD       AM_HC32_GPIO_MODE_CODE(0x1)   /**< \brief 下拉输入模式 */
#define PIOE_15_AIN            AM_HC32_GPIO_MODE_CODE(0x2)   /**< \brief 模拟输入模式 */
#define PIOE_15_INPUT_FLOAT    AM_HC32_GPIO_MODE_CODE(0x3)   /**< \brief 浮空输入模式 */
#define PIOE_15_OUT_PP         AM_HC32_GPIO_MODE_CODE(0x4)   /**< \brief 推挽输出模式 */
#define PIOE_15_OUT_OD         AM_HC32_GPIO_MODE_CODE(0x5)   /**< \brief 开漏输出模式 */
#define PIOE_15_AOUT           AM_HC32_GPIO_MODE_CODE(0x6)   /**< \brief 模拟输出模式 */
/** @} */

/**
 * \name PIOF_0引脚复用功能
 * @{
 */
#define PIOF_0_GPIO           AM_HC32_GPIO_REMAP_CODE(0x06, 0)
#define PIOF_0_I2C0_SDA       AM_HC32_GPIO_REMAP_CODE(0x06, 1)
#define PIOF_0_UART1_TXD      AM_HC32_GPIO_REMAP_CODE(0x06, 3)

/** @} */

/**
 * \name PIOF_0引脚复用时功能模式
 * @{
 */
#define PIOF_0_INPUT_PU       AM_HC32_GPIO_MODE_CODE(0x0)   /**< \brief 上拉输入模式 (默认) */
#define PIOF_0_INPUT_PD       AM_HC32_GPIO_MODE_CODE(0x1)   /**< \brief 下拉输入模式 */
#define PIOF_0_AIN            AM_HC32_GPIO_MODE_CODE(0x2)   /**< \brief 模拟输入模式 */
#define PIOF_0_INPUT_FLOAT    AM_HC32_GPIO_MODE_CODE(0x3)   /**< \brief 浮空输入模式 */
#define PIOF_0_OUT_PP         AM_HC32_GPIO_MODE_CODE(0x4)   /**< \brief 推挽输出模式 */
#define PIOF_0_OUT_OD         AM_HC32_GPIO_MODE_CODE(0x5)   /**< \brief 开漏输出模式 */
#define PIOF_0_AOUT           AM_HC32_GPIO_MODE_CODE(0x6)   /**< \brief 模拟输出模式 */
/** @} */

/**
 * \name PIOF_1引脚复用功能
 * @{
 */
#define PIOF_1_GPIO           AM_HC32_GPIO_REMAP_CODE(0x06, 0)
#define PIOF_1_I2C0_SCL       AM_HC32_GPIO_REMAP_CODE(0x06, 1)
#define PIOF_1_TIM4_CHB       AM_HC32_GPIO_REMAP_CODE(0x06, 2)
#define PIOF_1_UART1_RXD      AM_HC32_GPIO_REMAP_CODE(0x06, 3)

/** @} */

/**
 * \name PIOF_1引脚复用时功能模式
 * @{
 */
#define PIOF_1_INPUT_PU       AM_HC32_GPIO_MODE_CODE(0x0)   /**< \brief 上拉输入模式 (默认) */
#define PIOF_1_INPUT_PD       AM_HC32_GPIO_MODE_CODE(0x1)   /**< \brief 下拉输入模式 */
#define PIOF_1_AIN            AM_HC32_GPIO_MODE_CODE(0x2)   /**< \brief 模拟输入模式 */
#define PIOF_1_INPUT_FLOAT    AM_HC32_GPIO_MODE_CODE(0x3)   /**< \brief 浮空输入模式 */
#define PIOF_1_OUT_PP         AM_HC32_GPIO_MODE_CODE(0x4)   /**< \brief 推挽输出模式 */
#define PIOF_1_OUT_OD         AM_HC32_GPIO_MODE_CODE(0x5)   /**< \brief 开漏输出模式 */
#define PIOF_1_AOUT           AM_HC32_GPIO_MODE_CODE(0x6)   /**< \brief 模拟输出模式 */
/** @} */

/**
 * \name PIOF_2引脚复用功能
 * @{
 */
#define PIOF_2_GPIO           AM_HC32_GPIO_REMAP_CODE(0x06, 0)

/** @} */

/**
 * \name PIOF_2引脚复用时功能模式
 * @{
 */
#define PIOF_2_INPUT_PU       AM_HC32_GPIO_MODE_CODE(0x0)   /**< \brief 上拉输入模式 (默认) */
#define PIOF_2_INPUT_PD       AM_HC32_GPIO_MODE_CODE(0x1)   /**< \brief 下拉输入模式 */
#define PIOF_2_AIN            AM_HC32_GPIO_MODE_CODE(0x2)   /**< \brief 模拟输入模式 */
#define PIOF_2_INPUT_FLOAT    AM_HC32_GPIO_MODE_CODE(0x3)   /**< \brief 浮空输入模式 */
#define PIOF_2_OUT_PP         AM_HC32_GPIO_MODE_CODE(0x4)   /**< \brief 推挽输出模式 */
#define PIOF_2_OUT_OD         AM_HC32_GPIO_MODE_CODE(0x5)   /**< \brief 开漏输出模式 */
#define PIOF_2_AOUT           AM_HC32_GPIO_MODE_CODE(0x6)   /**< \brief 模拟输出模式 */
/** @} */

/**
 * \name PIOF_3引脚复用功能
 * @{
 */
#define PIOF_3_GPIO           AM_HC32_GPIO_REMAP_CODE(0x06, 0)

/** @} */

/**
 * \name PIOF_3引脚复用时功能模式
 * @{
 */
#define PIOF_3_INPUT_PU       AM_HC32_GPIO_MODE_CODE(0x0)   /**< \brief 上拉输入模式 (默认) */
#define PIOF_3_INPUT_PD       AM_HC32_GPIO_MODE_CODE(0x1)   /**< \brief 下拉输入模式 */
#define PIOF_3_AIN            AM_HC32_GPIO_MODE_CODE(0x2)   /**< \brief 模拟输入模式 */
#define PIOF_3_INPUT_FLOAT    AM_HC32_GPIO_MODE_CODE(0x3)   /**< \brief 浮空输入模式 */
#define PIOF_3_OUT_PP         AM_HC32_GPIO_MODE_CODE(0x4)   /**< \brief 推挽输出模式 */
#define PIOF_3_OUT_OD         AM_HC32_GPIO_MODE_CODE(0x5)   /**< \brief 开漏输出模式 */
#define PIOF_3_AOUT           AM_HC32_GPIO_MODE_CODE(0x6)   /**< \brief 模拟输出模式 */
/** @} */

/**
 * \name PIOF_4引脚复用功能
 * @{
 */
#define PIOF_4_GPIO           AM_HC32_GPIO_REMAP_CODE(0x06, 0)

/** @} */

/**
 * \name PIOF_4引脚复用时功能模式
 * @{
 */
#define PIOF_4_INPUT_PU       AM_HC32_GPIO_MODE_CODE(0x0)   /**< \brief 上拉输入模式 (默认) */
#define PIOF_4_INPUT_PD       AM_HC32_GPIO_MODE_CODE(0x1)   /**< \brief 下拉输入模式 */
#define PIOF_4_AIN            AM_HC32_GPIO_MODE_CODE(0x2)   /**< \brief 模拟输入模式 */
#define PIOF_4_INPUT_FLOAT    AM_HC32_GPIO_MODE_CODE(0x3)   /**< \brief 浮空输入模式 */
#define PIOF_4_OUT_PP         AM_HC32_GPIO_MODE_CODE(0x4)   /**< \brief 推挽输出模式 */
#define PIOF_4_OUT_OD         AM_HC32_GPIO_MODE_CODE(0x5)   /**< \brief 开漏输出模式 */
#define PIOF_4_AOUT           AM_HC32_GPIO_MODE_CODE(0x6)   /**< \brief 模拟输出模式 */
/** @} */

/**
 * \name PIOF_5引脚复用功能
 * @{
 */
#define PIOF_5_GPIO           AM_HC32_GPIO_REMAP_CODE(0x06, 0)

/** @} */

/**
 * \name PIOF_5引脚复用时功能模式
 * @{
 */
#define PIOF_5_INPUT_PU       AM_HC32_GPIO_MODE_CODE(0x0)   /**< \brief 上拉输入模式 (默认) */
#define PIOF_5_INPUT_PD       AM_HC32_GPIO_MODE_CODE(0x1)   /**< \brief 下拉输入模式 */
#define PIOF_5_AIN            AM_HC32_GPIO_MODE_CODE(0x2)   /**< \brief 模拟输入模式 */
#define PIOF_5_INPUT_FLOAT    AM_HC32_GPIO_MODE_CODE(0x3)   /**< \brief 浮空输入模式 */
#define PIOF_5_OUT_PP         AM_HC32_GPIO_MODE_CODE(0x4)   /**< \brief 推挽输出模式 */
#define PIOF_5_OUT_OD         AM_HC32_GPIO_MODE_CODE(0x5)   /**< \brief 开漏输出模式 */
#define PIOF_5_AOUT           AM_HC32_GPIO_MODE_CODE(0x6)   /**< \brief 模拟输出模式 */
/** @} */

/**
 * \name PIOF_6引脚复用功能
 * @{
 */
#define PIOF_6_GPIO           AM_HC32_GPIO_REMAP_CODE(0x06, 0)
#define PIOF_6_I2C1_SCL       AM_HC32_GPIO_REMAP_CODE(0x06, 1)
#define PIOF_6_LPUART1_CTS    AM_HC32_GPIO_REMAP_CODE(0x06, 2)
#define PIOF_6_UART0_CTS      AM_HC32_GPIO_REMAP_CODE(0x06, 3)

/** @} */

/**
 * \name PIOF_6引脚复用时功能模式
 * @{
 */
#define PIOF_6_INPUT_PU       AM_HC32_GPIO_MODE_CODE(0x0)   /**< \brief 上拉输入模式 (默认) */
#define PIOF_6_INPUT_PD       AM_HC32_GPIO_MODE_CODE(0x1)   /**< \brief 下拉输入模式 */
#define PIOF_6_AIN            AM_HC32_GPIO_MODE_CODE(0x2)   /**< \brief 模拟输入模式 */
#define PIOF_6_INPUT_FLOAT    AM_HC32_GPIO_MODE_CODE(0x3)   /**< \brief 浮空输入模式 */
#define PIOF_6_OUT_PP         AM_HC32_GPIO_MODE_CODE(0x4)   /**< \brief 推挽输出模式 */
#define PIOF_6_OUT_OD         AM_HC32_GPIO_MODE_CODE(0x5)   /**< \brief 开漏输出模式 */
#define PIOF_6_AOUT           AM_HC32_GPIO_MODE_CODE(0x6)   /**< \brief 模拟输出模式 */
/** @} */

/**
 * \name PIOF_7引脚复用功能
 * @{
 */
#define PIOF_7_GPIO           AM_HC32_GPIO_REMAP_CODE(0x06, 0)
#define PIOF_7_I2C1_SDA       AM_HC32_GPIO_REMAP_CODE(0x06, 1)
#define PIOF_7_LPUART1_RTS    AM_HC32_GPIO_REMAP_CODE(0x06, 2)
#define PIOF_7_UART0_RTS      AM_HC32_GPIO_REMAP_CODE(0x06, 3)

/** @} */

/**
 * \name PIOF_7引脚复用时功能模式
 * @{
 */
#define PIOF_7_INPUT_PU       AM_HC32_GPIO_MODE_CODE(0x0)   /**< \brief 上拉输入模式 (默认) */
#define PIOF_7_INPUT_PD       AM_HC32_GPIO_MODE_CODE(0x1)   /**< \brief 下拉输入模式 */
#define PIOF_7_AIN            AM_HC32_GPIO_MODE_CODE(0x2)   /**< \brief 模拟输入模式 */
#define PIOF_7_INPUT_FLOAT    AM_HC32_GPIO_MODE_CODE(0x3)   /**< \brief 浮空输入模式 */
#define PIOF_7_OUT_PP         AM_HC32_GPIO_MODE_CODE(0x4)   /**< \brief 推挽输出模式 */
#define PIOF_7_OUT_OD         AM_HC32_GPIO_MODE_CODE(0x5)   /**< \brief 开漏输出模式 */
#define PIOF_7_AOUT           AM_HC32_GPIO_MODE_CODE(0x6)   /**< \brief 模拟输出模式 */
/** @} */

/**
 * \name PIOF_9引脚复用功能
 * @{
 */
#define PIOF_9_GPIO           AM_HC32_GPIO_REMAP_CODE(0x06, 0)
#define PIOF_9_TIM0_CHA       AM_HC32_GPIO_REMAP_CODE(0x06, 1)

/** @} */

